[
  {
    "url": "https://finance.yahoo.com/quote/RNA/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 4.37B Enterprise Value 2.99B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 495.62 Price/Book (mrq) 3.29 Enterprise Value/Revenue 335.36 Enterprise Value/EBITDA -- Profit Margin 0.00% Return on Assets (ttm) -22.47% Return on Equity (ttm) -34.19% Revenue (ttm) 8.93M Net Income Avi to Common (ttm) -369.22M Diluted EPS (ttm) -3.00 Total Cash (mrq) 1.38B Total Debt/Equity (mrq) 0.45% Levered Free Cash Flow (ttm) -245.73M Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/m/38d8fc2f-fb71-3c4a-9d5b-0c59d2aa756c/comex-gold-settles-0-28-.html",
    "text": "Gold settled 0.3% higher, snapping a two-session losing streak, and silver rose 1.8%, up for a fourth consecutive session."
  },
  {
    "url": "https://finance.yahoo.com/m/d02e4907-769b-3c47-8a49-72a2d4e01b32/hot-ipo-etoro-charges-to-new.html",
    "text": "Analysts weighed in with generally positive initial coverage ratings on Monday, sending eToro shares past a buy point."
  },
  {
    "url": "https://finance.yahoo.com/quote/ETOR/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 5.75B Enterprise Value 2.17B Trailing P/E 29.25 Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.45 Price/Book (mrq) 6.91 Enterprise Value/Revenue 0.17 Enterprise Value/EBITDA 7.32 Profit Margin 1.54% Return on Assets (ttm) 19.32% Return on Equity (ttm) 26.91% Revenue (ttm) 12.52B Net Income Avi to Common (ttm) 192.38M Diluted EPS (ttm) 2.35 Total Cash (mrq) 259.59M Total Debt/Equity (mrq) 56.82% Levered Free Cash Flow (ttm) 168.43M"
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_3715_AnalystReport_1749466900000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Symbols Sector(s) Financial Services Rating Earnings Estimate Current Price $58.93 Price Target Summary Brighthouse Financial provides life insurance and annuity products in the U.S. The company was spun off from MetLife in August 2017. It has approximately 1500 employees. Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Analyst Report: American International Group, Inc. Jun 07, 2025 • AIG Technical Assessment: Bullish in the Intermediate-Term Jun 06, 2025 • IBM, AIG LNC: What does Argus have to say about LNC? Jun 04, 2025 • LNC ASB: Lowering target price to $24.00 Jun 04, 2025 • ASB AIZ: Raising target price to $226.00 Jun 04, 2025 • AIZ Kevin Heal Chief Compliance Officer & Senior Analyst: Financial Services Kevin is the Chief Compliance Officer for the Argus Research Group. His responsibilities include ensuring that the firm is SEC compliant and adheres to all rules and regulations. He has over thirty years of Wall Street experience with both large investment banks and regional dealers most recently with a hedge fund Sandler Capital Management. He will also provide research coverage for select financial institutions under coverage at Argus Research Company. Kevin graduated from Northwestern University with a B.A. in Economics and maintains the Series 65 registration."
  },
  {
    "url": "https://finance.yahoo.com/quote/BHF/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 3.40B Enterprise Value 5.80B Trailing P/E 7.58 Forward P/E 2.98 PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.54 Price/Book (mrq) 0.65 Enterprise Value/Revenue 0.87 Enterprise Value/EBITDA -- Profit Margin 7.12% Return on Assets (ttm) 0.63% Return on Equity (ttm) 12.92% Revenue (ttm) 8.61B Net Income Avi to Common (ttm) 511M Diluted EPS (ttm) 7.82 Total Cash (mrq) 6.86B Total Debt/Equity (mrq) 172.10% Levered Free Cash Flow (ttm) -958M Q2'24 Q3'24 Q4'24 Q1'25 Brighthouse Financial provides life insurance and annuity products in the U.S. The company was spun off from MetLife in August 2017. It has approximately 1500 employees. BHF shares are a component of the S&P 400 Mid-Cap Index. Watching Weekly Claims Wall Street's focus flips back to inflation this week, as key consumer and producer inflation data is due out. Last week, the Dow Jones Industrial Average gained 1.2%, the S&P 500 rose 2.2%, and the Nasdaq popped 1.5%. So far this year, the Dow is up 0.5%, the S&P 2%, and the Nasdaq 1%. Earnings report this week include GameStop, J.M. Smucker, and Dave & Buster's on Tuesday; Oracle and Chewy on Wednesday; and Adobe on Thursday. The final scoreboard for 1Q showed earnings growth of 14%, this after 17% growth in 4Q24 and 9% in 3Q24, according to LSEG. For 1Q, Healthcare was the leading sector, up 46%, while Energy was at the bottom, down 17%. On the economic calendar, Wednesday features the Consumer Price Index, Thursday the Producer Price Index, and Friday an update on Consumer Sentiment. We have adjusted our S&P 500 EPS estimates. For 2025, our forecast for S&P 500 earnings from continuing operations is now $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. Meanwhile, the Economic Call of the Week from Argus Chief Economist Chris Graja, CFA, is the report on Initial Jobless Claims, on which he offered the following. 'Last week's print of 247,000 claims for the week ended May 31 is a wake-up call -- but not a fire alarm. Recent data shows a job market that is solid but slowing. The Unemployment Rate is low and steady at 4.2%. Payrolls rose by a solid 139,000 in May, but growth in March and April was revised lower by a notable 95,000. Is this revision and the increase in unemployment claims an inflection point for the economy? Weekly Jobless Claims, which are regarded as a leading economic indicator, can help make an assessment. Next week's four-week moving average of new filings for unemployment insurance will almost certainly remain below the level of 300,000, the level that raises our fears of a recession. But with nearly 285,000 job cuts announced by the federal government this year and only 59,000 appearing in the monthly employment reports through May, we will take a close look at our forecasts if the four-week average stays above 250,000 for several weeks. Turning to other data, the Atlanta Fed GDPNow forecast is at 3.8% for 2Q. That follows the decline of 0.3% for 1Q. The Cleveland Fed Inflation Nowcast calls for a 2.7% rate for CPI in June, which is higher than the May rate. Mortgage rates inched lower last week, with the average 30-year fixed-rate mortgage at 6.85%, according to FreddieMac. Gas prices ticked down three cents to an average of $3.13 per gallon for regular gas. Looking ahead, the next Fed rate decision is on June 18, with odds at 3% for a rate cut, according to the CME FedWatch rate tool. The next meeting after that is on July 30, and odds for a rate cut have fallen to 16%. Brighthouse Financial provides life insurance and annuity products in the U.S. The company was spun off from MetLife in August 2017. It has approximately 1500 employees. BHF shares are a component of the S&P 400 Mid-Cap Index. The major stock indices are all higher at midday on Friday, although higher stock prices at midday have not been a guarantee of higher stock prices at the close of late (or ever). Overall, there is still a lot of pressure on equities and the technical condition of the overall stock market is weakening. On the positive side, an imminent shutdown of the U.S. government seem less likely than more likely. On the negative side, consumer sentiment plunged in March and inflation expectations increased. Specifically, the University of Michigan sentiment survey fell to 57.9 from 64.7 last month, while worries about tariffs and trade wars are leading to growing expectations that overall prices are on track to rise."
  },
  {
    "url": "https://finance.yahoo.com/quote/BHFAP/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap -- Enterprise Value -- Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) -- Price/Book (mrq) -- Enterprise Value/Revenue -- Enterprise Value/EBITDA -- Profit Margin 7.12% Return on Assets (ttm) 0.63% Return on Equity (ttm) 12.92% Revenue (ttm) 8.61B Net Income Avi to Common (ttm) 511M Diluted EPS (ttm) 12.61 Total Cash (mrq) 6.86B Total Debt/Equity (mrq) 172.10% Levered Free Cash Flow (ttm) -958M Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/personal-finance/banking/article/4-percent-interest-savings-accounts-175301904.html",
    "text": "Some advertisements and offers on this page are from advertisers who pay us. That may influence which products we write about, but it does not affect what we write about them. Here's an explanation of how we make money and our Advertiser Disclosure. Today, the national average interest rate for savings accounts is just 0.42%, according to the FDIC. But that doesn’t mean you’re stuck earning a low rate on your savings. Many banks and credit unions offer high-yield savings accounts with an annual percentage yield (APY) of 4% or more, allowing you to maximize your savings potential and hit your savings goals even faster. Here’s a look at some of the top federally insured high-yield savings accounts available today that currently offer 4% APY and higher. Note that interest rates, fees, and requirements are accurate as of the publish date. Please verify account details directly with the financial institution. Digital Federal Credit Union (DCU) offers a high-yield savings account with the highest APY on our list at 5.5%. The catch: This rate only applies to balances up to $1,000; balances above $1,000 earn 0.05% APY. Even so, this great rate could get the ball rolling on growing your savings. The minimum deposit needed to open this account is $5.00, and there's no monthly maintenance fee or minimum balance required to earn the disclosed APY. Eligibility for membership with DCU is determined by a prospective member’s relationship to a current member, employment at an eligible company, geographic area, or involvement in qualifying organizations. Varo Bank’s High-Yield Savings Account offers an attractive 5% APY on balances up to $5,000 (balances over this threshold earn 2.5% APY). There’s no minimum balance required and no monthly fees. This account also allows for automatic round-ups to give your savings a boost over time. Read our full review of Varo Bank The AlumniFi Savings account is a tiered account that pays higher interest on higher balances: Tier 1 (up to $24,999): 4.25% APY Tier 2 ($25,000 to $99,999): 4.5% APY Tier 3 ($100,000 and up): 4.75% APY AlumniFi accounts are held at Michigan State University Federal Credit Union where savings are federally insured to at least $250,000 by the NCUA. The Pibank Savings account offers a competitive 4.6% APY with no fees or minimum balance requirements. Interest accrues daily and is credited monthly on the 15th. FitnessBank — a division of Affinity Bank — is a new online lifestyle bank. The Fitness Savings Account requires a minimum opening deposit of $100. There is a $10 maintenance fee, which can be waived with a $100 minimum average daily balance. Customers who also open an Elite Checking account can boost their rate to 5.00% APY. LendingClub’s LevelUp Savings account currently offers 4.4% APY with no minimum balance required. But in order to earn the highest advertised rate, you must deposit at least $250 to the account monthly. If you miss a month, your balance will earn 3.5% APY instead. There are no monthly fees associated with this savings account. Interest is compounded daily and credited monthly. Read our full review of LendingClub Bank Primis Bank’s Savings Account can be opened online with just $1. This account offers 4.35% APY with no minimum balance requirements, monthly service fees, or transaction limits. Interest is compounded and credited monthly. BrioDirect’s High-Yield Savings Account boasts 4.3% APY with no monthly maintenance fees. You need a minimum of $5,000 to open this account and must maintain at least $25 to earn the disclosed APY. Read our full review of BrioDirect Bread Savings’ High-yield Savings Account offers 4.3% APY with no monthly fees. You must deposit a minimum of $100 to open an account. Interest is compounded daily and credited monthly. Read our full review of Bread Savings EverBank’s Performance Savings pays 4.3% APY on all balances. There is no monthly maintenance fee or minimum balance requirement. This account is completely free to open, and interest is compounded daily. Read our full review of EverBank TAB’s high-yield savings account currently offers 4.26% APY with no minimum deposit required. There are also no monthly maintenance fees and no cap on how much of your balance can earn interest. You must maintain at least a penny in your account to obtain the disclosed APY. Read our full review of TAB Bank First Foundation Bank’s Online Savings Account offers 4.25% APY with no monthly maintenance fees. The minimum opening deposit is $1,000, and you must maintain at least $0.01 to earn interest. Read our full review of First Foundation Bank The Premier Online Savings Account from Poppy Bank offers a competitive 4.25% APY. This rate only applies to accounts opened online, and a minimum balance of $1,000 must be maintained to obtain the advertised rate. The Ivy Bank High-Yield Savings Account offers 4.25% APY on balances of $2,500 and up (balances below this threshold earn 0.05% APY). Interest is compounded daily and credited monthly. Bask Bank’s Interest Savings Account offers 4.2% APY with no monthly account fees or minimum deposit requirements. However, it’s important to note that Bask Bank does not offer ATM or debit cards, so withdrawals must be made electronically or via wire transfer. Read our full review of Bask Bank The Jenius Bank Savings account offers an impressive 4.2% APY with no minimum deposit or minimum balance requirement. There are also no monthly fees, and customer service representatives are available 24/7. Read our full review of Jenius Bank Live Oak Bank’s High Yield Savings Account pays 4.1% APY — more than 10 times the national average. There is no minimum opening deposit requirement for this account. However, you must keep at least $0.01 in your account to continue to earn interest. CIT Bank’s Platinum Savings Account boasts 4.1% APY on balances of $5,000 or more (balances under $5,000 earn 0.25% APY). A minimum opening deposit of $100 is required. There are no monthly fees associated with this account. Read our full review of CIT Bank Popular Direct’s Select Savings Account currently offers 4.05% APY with a minimum opening deposit of $100 and no monthly fees. You must maintain at least $0.01 in your account to earn interest. Read our full review of Popular Direct Upgrade offers an online savings account that currently earns 4.02% APY on balances of $1,000 and up with no monthly maintenance fees. Your deposits are also insured up to $1 million through the FDIC and/or NCUA via Upgrade's participating institutions. The Portfolio Savings account from UFB DIrect allows you to earn 4.01% APY on all balances. There are no maintenance fees or minimum deposit requirements. Plus, the account comes with a complimentary ATM card and free transfers between direct deposit accounts. Read our full review of UFB Direct By subscribing, you are agreeing to Yahoo's Terms and Privacy Policy The amount of interest you can earn with a rate of 4% depends on how much money you deposit. The more money you keep in your account, and the longer you hold it there, the more you stand to earn thanks to compound interest. For example, if you deposited $1,000 into a 4% interest savings account that compounds interest daily and left the money there for one year, you'd earn a total of $40 in interest (assuming you don't make any additional contributions). Let's say you deposited $10,000. At the end of the year, you'd earn $400 in interest. And if you made an additional $100 contribution each month, you'd end up with $421.84 in interest earnings. Finding a savings account that pays 4% on your balance is a great way to give your savings a boost and help it grow over time. However, there are additional steps you can take to get the most value out of your account. Start with a higher principal balance: The more money you deposit initially, the more interest you earn from the start. Contribute regularly: Consider setting up automatic transfers to the savings account. Even small, consistent deposits can make a big difference over time. If you contribute $100 monthly — that’s an extra $1,200 per year that earns 4% interest, which compounds to grow even more. Take advantage of compound interest: Make sure the interest on your account compounds at least monthly, if not daily. The more frequently interest is compounded, the more your money will grow. Keep your money in the account: Each time you withdraw funds from your savings account, the principal balance that earns interest decreases, which reduces the overall growth potential. A checking account or money market account may be a better fit for money you need for daily spending or paying bills. Watch out for fees: Look for a savings account with no monthly maintenance fees or other charges that could eat into your interest. Some high-yield accounts have minimum balance requirements to avoid fees or earn the highest advertised rate, so be sure you can meet those minimums — or choose an account with no minimum balance requirement. See our picks for the 10 best high-yield savings accounts Savings accounts that offer 4% are becoming increasingly hard to find. Recent rate cuts by the Federal Reserve signal that the economy is moving in the right direction, but they also mean deposit account rates are on the decline. Additional rate cuts could be on the horizon, so it pays to take advantage of an account with a higher rate while it lasts. For those looking to maximize their savings, it might be wise to take advantage of current rates while they remain elevated. If you want to lock in today's higher rates, you may want to consider a certificate of deposit (CD) instead of a high-yield savings account. A bank account's interest rate is how much it earns in one year, while APY represents your total annual interest with compounding factored in. Read on to learn more about APY vs. interest rate. CD interest rates play a key role in how much your savings can grow. Find out where today’s average CD rates stand and how to maximize your interest earnings. We analyzed more than 100 data points to find the best money market accounts available today. See our top picks based on interest rates, fees, and more. If you’re looking for a way to increase your interest earnings, consider this new cash account from fintech app Marygold & Co. Learn more about this account’s benefits and features. Verizon and Openbank recently partnered to offer a high-yield savings account that comes with Verizon Wireless discounts. Here’s how it works and how to apply. The Apple Savings account allows you to earn interest on Apple credit card rewards. But it does have some drawbacks. Find out if the Apple Savings account is right for you."
  },
  {
    "url": "https://finance.yahoo.com/m/e7e165e4-0ac1-33f4-a98b-a800a5ed74fe/stock-market-today-dow-jones.html",
    "text": "The Dow Jones dropped on the stock market today as U.S.-China trade talks kicked off. Tesla stock reversed higher while bitcoin shined."
  },
  {
    "url": "https://finance.yahoo.com/news/repair-credit-5-steps-110032612.html",
    "text": "A good credit score can help you qualify for loans, lower your interest rates and even expand housing and job opportunities. Responsible financial habits — like paying on time and keeping debt low — are key to rebuilding credit. Even with a bad credit score, there are ways to rebuild it over time without taking on unnecessary debt. A good credit score can affect everything from your chances to receive loans or credit cards to your ability to rent an apartment. If your score isn’t where you want it to be, the good news is that it’s not permanent. Rebuilding credit takes consistency, patience and a strategy that fits your situation. Whether you’re starting from scratch or recovering from past mistakes, there are steps you can take to get your score back on track. Start by figuring out where your credit stands. Knowing your score — and what’s in your credit reports — gives you a baseline to work from. Checking your own credit score and reports does not damage your credit. You can check your credit score and reports for free through a number of reputable sources: AnnualCreditReport.com. Through this website authorized by the federal government, you can request free weekly credit reports from the three credit bureaus: Equifax, Experian and TransUnion. These reports do not include your credit score. Credit bureaus. The major credit bureaus offer free and paid-for credit scores. Read the fine print to make sure you aren’t accidentally signing up for a subscription service you don’t need. Nonprofit credit counselors. A credit counselor may be able to provide you with a free credit report and credit score and help you understand the finer details of your reports. Your bank or credit card provider. Many lenders and credit card issuers provide free credit score tracking. You may find this information on your monthly account statement or your online dashboard. To protect yourself from identity theft, request credit information only from reputable sources. Once you have a copy of your credit reports, check them carefully for errors. Mistakes on credit reports are more common than you might think. A 2024 Consumer Reports study found that 44 percent of consumers have at least one error on their credit reports. Some errors can be harmless, like incorrect middle initials, but some can decrease your credit score. Some common credit report errors to watch out for include: Accounts that don’t belong to you Closed accounts reported as open or open accounts reported as closed Incorrect credit limits or account balances Information from someone else’s credit report Payments wrongly reported as late or missed Your credit report mistakenly marks you as deceased"
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_3630_AnalystReport_1749466900000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Symbols Sector(s) Consumer Cyclical Rating Earnings Estimate Current Price $299.05 Price Target Summary Tesla Inc. manufactures and sells electric vehicles, and energy generation and storage systems. The company was founded in 2003 and went public in June 2010 with an initial public offering at $17 per share. Tesla has approximately 49,000 employees. It recently moved its headquarters Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Analyst Report: Microsoft Corporation Jun 07, 2025 • MSFT Analyst Report: Meta Platforms, Inc. Jun 04, 2025 • META Daily – Vickers Top Buyers & Sellers for 06/04/2025 Jun 04, 2025 • SUNS, NVDA, ABR, AFBI, NRG, SDHY, PAG, APEI, CCO, MAR Analyst Report: NIO Inc. Jun 04, 2025 • NIO William V. Selesky Senior Analyst: Basic Materials Bill covers the Basic Materials sector for Argus. He has worked in the investment business for over 15 years, including positions as a senior equity analyst for firms such as Palisade Capital Management, PaineWebber/Mitchell Hutchins Asset Management and John Hsu Capital Group. He has provided coverage on groups including Consumer Staples, Consumer Discretionary, Energy, Media, Transportation, Gaming and Utilities. At PaineWebber, he also served as part of a team that managed $9 billion in active equity products. Prior to working in the investment field, Bill spent eight years as a credit analyst at American Express Company and five years as an analyst at Equifax Services. Bill has a Masters of Business Administration degree in Investment Finance from Pace University, and a Bachelor of Science degree in Economics from Fordham University."
  },
  {
    "url": "https://finance.yahoo.com/quote/TSLA/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 950.63B Enterprise Value 926.77B Trailing P/E 168.65 Forward P/E 140.85 PEG Ratio (5yr expected) 4.73 Price/Sales (ttm) 10.81 Price/Book (mrq) 12.73 Enterprise Value/Revenue 9.68 Enterprise Value/EBITDA 68.02 Profit Margin 6.38% Return on Assets (ttm) 3.72% Return on Equity (ttm) 8.77% Revenue (ttm) 95.72B Net Income Avi to Common (ttm) 6.11B Diluted EPS (ttm) 1.74 Total Cash (mrq) 37B Total Debt/Equity (mrq) 17.41% Levered Free Cash Flow (ttm) 3.36B Q2'24 Q3'24 Q4'24 Q1'25 Tesla Inc. manufactures and sells electric vehicles, and energy generation and storage systems. The company was founded in 2003 and went public in June 2010 with an initial public offering at $17 per share. Tesla has approximately 49,000 employees. It recently moved its headquarters to Austin, Texas from Palo Alto, California and its stock is a component of the S&P 500 index. Watching Weekly Claims Wall Street's focus flips back to inflation this week, as key consumer and producer inflation data is due out. Last week, the Dow Jones Industrial Average gained 1.2%, the S&P 500 rose 2.2%, and the Nasdaq popped 1.5%. So far this year, the Dow is up 0.5%, the S&P 2%, and the Nasdaq 1%. Earnings report this week include GameStop, J.M. Smucker, and Dave & Buster's on Tuesday; Oracle and Chewy on Wednesday; and Adobe on Thursday. The final scoreboard for 1Q showed earnings growth of 14%, this after 17% growth in 4Q24 and 9% in 3Q24, according to LSEG. For 1Q, Healthcare was the leading sector, up 46%, while Energy was at the bottom, down 17%. On the economic calendar, Wednesday features the Consumer Price Index, Thursday the Producer Price Index, and Friday an update on Consumer Sentiment. We have adjusted our S&P 500 EPS estimates. For 2025, our forecast for S&P 500 earnings from continuing operations is now $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. Meanwhile, the Economic Call of the Week from Argus Chief Economist Chris Graja, CFA, is the report on Initial Jobless Claims, on which he offered the following. 'Last week's print of 247,000 claims for the week ended May 31 is a wake-up call -- but not a fire alarm. Recent data shows a job market that is solid but slowing. The Unemployment Rate is low and steady at 4.2%. Payrolls rose by a solid 139,000 in May, but growth in March and April was revised lower by a notable 95,000. Is this revision and the increase in unemployment claims an inflection point for the economy? Weekly Jobless Claims, which are regarded as a leading economic indicator, can help make an assessment. Next week's four-week moving average of new filings for unemployment insurance will almost certainly remain below the level of 300,000, the level that raises our fears of a recession. But with nearly 285,000 job cuts announced by the federal government this year and only 59,000 appearing in the monthly employment reports through May, we will take a close look at our forecasts if the four-week average stays above 250,000 for several weeks. Turning to other data, the Atlanta Fed GDPNow forecast is at 3.8% for 2Q. That follows the decline of 0.3% for 1Q. The Cleveland Fed Inflation Nowcast calls for a 2.7% rate for CPI in June, which is higher than the May rate. Mortgage rates inched lower last week, with the average 30-year fixed-rate mortgage at 6.85%, according to FreddieMac. Gas prices ticked down three cents to an average of $3.13 per gallon for regular gas. Looking ahead, the next Fed rate decision is on June 18, with odds at 3% for a rate cut, according to the CME FedWatch rate tool. The next meeting after that is on July 30, and odds for a rate cut have fallen to 16%. Tesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network. Tesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network."
  },
  {
    "url": "https://finance.yahoo.com/m/1bcc4262-3761-3b9f-8238-091e7e24ce7d/%E2%80%98inflation-week%E2%80%99-kicks-off-as.html",
    "text": "Investors are waiting for a series of readings on U.S. price pressures, and two important auctions of Treasury debt."
  },
  {
    "url": "https://finance.yahoo.com/m/9aeeb7a0-da7f-37e3-ba3c-fa2583a54c41/starbucks-cuts-prices-in.html",
    "text": "Starbucks will lower prices for several drinks in China, the company announced on Monday, as the cafe chain attempts to accelerate sluggish sales in its largest international market. In a post on the Chinese social-media platform Weixin, Starbucks said it would slash prices by an average of 5 yuan, or about 70 cents, on “non-coffee” Frappuccino, iced tea, and tea latte beverages to entice afternoon customers. Starbucks didn’t respond to a request for comment beyond the post."
  },
  {
    "url": "https://finance.yahoo.com/quote/SBUX/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 101.87B Enterprise Value 124.86B Trailing P/E 32.60 Forward P/E 29.85 PEG Ratio (5yr expected) 2.19 Price/Sales (ttm) 2.81 Price/Book (mrq) -- Enterprise Value/Revenue 3.44 Enterprise Value/EBITDA 19.71 Profit Margin 8.61% Return on Assets (ttm) 8.98% Return on Equity (ttm) -- Revenue (ttm) 36.35B Net Income Avi to Common (ttm) 3.13B Diluted EPS (ttm) 2.75 Total Cash (mrq) 3.01B Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) 1.85B Q2'24 Q3'24 Q4'24 Q1'25 The stock market treaded water on Wednesday, but it's too early to start worrying about the famous term we hear when the weather begins to heat up and the masses head to the shore, or the mountains, or anywhere away from home. That would be the \"Summer Doldrums,\" which in our view starts around Independence Day and lasts until Labor Day. Trading volume slows and the months of July and August on occasion can be volatile, with a share of downside action. The recent metals market has been nothing short of confusing, and our call for some decent downside, especially in gold, has not been on the mark. GLD peaked at an intraday high of $317.63 on April 22 after a nine-day parabolic move. That spike occurred after a very strong rally that started early this year. The beginning of the overall current uptrend started back in early 2024, with GLD in the $190 area. The metal had been in a multi-year base that started in August 2020, so there was a lot of pent-up demand that had to be released. The reason for the major breakout and huge rally is still unknown, as it has corresponded with a very choppy U.S. Dollar Index. Generally, gold and silver respond well to a weak greenback, and vice versa. So far, GLD dropped to an intraday low of $291.78 on May 16, which just happened to be the location of the rising 50-day average. It's possible that GLD has been tracing out a bull flag since its peak, working off extreme overbought momentum. Unless the recent low gets taken out with conviction, the likelihood of another run higher is strong. (Mark Arbeter, CMT) Director of Research Jim Kelleher, CFA, has surveyed the Argus analyst team about the impact of tariffs on companies in the Argus Universe of Coverage. The tariff environment is dynamic, to say the least. The White House has levied tariffs or threatened to levy tariffs, but often paused, postponed, or withdrawn pledged tariffs. Most recently, China and the U.S. agreed to reduce baseline tariffs to 10% for 90 days (30% in the U.S. reflecting a 20% fentanyl penalty). More than the tariffs themselves, the lack of a finished tariff infrastructure complicates business planning, staffing decisions, and capital investment. Within this dynamic environment, companies are focused on taking actions in areas they can control and planning proactively for a range of tariff scenarios. Companies are anticipating both direct and indirect tariff impacts. Direct impacts would include higher costs for imported finished goods and components, foregone sales as a result of reciprocal tariffs in other nations, and other factors. For example, a manufacturing company would face direct impacts as it pays higher prices for imported parts. Indirect impacts would include a slowing in business related to a broad softening in the economy. All companies likely will feel indirect impacts. A utility, for example, could begin to see a slowing in industrial and commercial kilowatt-hour sales, particularly in niches such as warehousing, trucking and rail, and other freight-related functions. We asked Argus analysts to survey their companies for their commentary on direct and indirect tariff impacts, as well as actions these companies are taking to mitigate the challenging trade environment. Nearly every company in Argus analyst coverage has issued commentary regarding tariffs, much as (five years ago) nearly every company in coverage had something to say about the then-developing COVID-19 pandemic. Below we offer a sampling of company responses to the unfolding tariff environment across a range of sectors and industries. We intend to update our survey on a regular basis at least until the tariff environment, in whatever shape or form, becomes a stable part of the U.S. economy. We are raising our intermediate-term technical outlook back to bullish from neutral. The major indices all traced out bullish ABC reversal patterns from April 8 until April 22 and have taken on the look of a \"V\" bottom. After the massive gains on Monday, when the S&P 500 (SPX) soared 3.1%, the Nasdaq rocketed 4.2%, and the Nasdaq 100 (QQQ) surged 3.9%, the three indices broke convincingly above their flat 200-day and 50-week averages for the first time since losing these key supports in early March. As well, the indices all broke well above the key 61.8% retracement of their correction/bear markets. They also completed large and compact bullish inverse head-and-shoulders formations. This all suggests a run at least back to the earlier all-time highs, and possibly higher. Some of the key intermediate-term signals that have turned bullish -- and that we have discussed recently -- include a number of breadth thrusts usually seen at key market bottoms; an absolute destruction in market sentiment in March and April; a buy signal from the weekly Bollinger Band (BB) chart, as the SPX lost, then recovered, the lower BB; very large monthly bullish candlesticks for the major indices; and new all-time highs for the major advance/decline lines. The SPX completed a 950-point reversal and, based on its size, we estimate a minimum measured move to the 6,450-6,740 region, or 11%-15% higher than Monday's close. For the QQQ (507), we project a minimum advance to 557-585, or a 10%-15% move. The next obstacle is the all-time highs of 6,144 for the SPX and 539 for the QQQ. (Mark Arbeter, CMT) This pick list highlights constituents of the Morningstar US Large Cap Index that we believe offer investors the best risk-adjusted return prospects. Stocks of large-cap companies where neither growth nor value characteristics predominate. Stocks in the top 70% of the capitalization of the U.S. equity market are defined as large cap."
  },
  {
    "url": "https://finance.yahoo.com/m/09252e7f-03b5-3ae4-8470-7d429179a320/this-trade-might-be-best.html",
    "text": "Investors who think Robinhood stock might trade sideways for a few months could look at selling covered calls on their underlying position."
  },
  {
    "url": "https://finance.yahoo.com/quote/HOOD/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 66.08B Enterprise Value 63.92B Trailing P/E 42.79 Forward P/E 50.25 PEG Ratio (5yr expected) -- Price/Sales (ttm) 20.89 Price/Book (mrq) 8.31 Enterprise Value/Revenue 19.61 Enterprise Value/EBITDA 47.42 Profit Margin 48.77% Return on Assets (ttm) 4.32% Return on Equity (ttm) 21.43% Revenue (ttm) 3.26B Net Income Avi to Common (ttm) 1.59B Diluted EPS (ttm) 1.75 Total Cash (mrq) 12.99B Total Debt/Equity (mrq) 118.06% Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions."
  },
  {
    "url": "https://finance.yahoo.com/m/e2c877c2-42b5-32d8-8d02-f0b640554520/charles-schwab-to-cut-cost.html",
    "text": "Charles Schwab’s asset-management unit said Monday it will cut fees on four index exchange-traded funds and it announced another method to lower costs for investors—it is splitting shares (comparable to a stock split, so the funds will cost less per share) on six Schwab mutual funds. The moves may help Schwab attract more customer dollars as the cost-savings on ETFs will help it compete with other low-cost funds and the share split will make shares more affordable. The fee reductions, which will be effective June 10, are between 0.02 and 0.04 percentage points (or two and four basis points) for each fund."
  },
  {
    "url": "https://finance.yahoo.com/quote/SCHW/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 160.35B Enterprise Value -- Trailing P/E 26.74 Forward P/E 20.88 PEG Ratio (5yr expected) 1.10 Price/Sales (ttm) 7.90 Price/Book (mrq) 3.98 Enterprise Value/Revenue 10.23 Enterprise Value/EBITDA -- Profit Margin 31.71% Return on Assets (ttm) 1.39% Return on Equity (ttm) 14.12% Revenue (ttm) 20.47B Net Income Avi to Common (ttm) 6.02B Diluted EPS (ttm) 3.30 Total Cash (mrq) 76.48B Total Debt/Equity (mrq) 110.20% Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25 Vickers Stock Research, a subsidiary of Argus Research Group, analyzes insider trading and institutional stock ownership. Form 13-F, which institutions must file to report their holdings, is due 45 days after the end of calendar quarters and have come in for 4Q24. We review the 13-Fs of major institutional investors to see what they are buying and to look for trends. Volatility in the stock market during the first quarter gave those institutional investors a chance to buy the dips, picking up some new companies or adding to existing holdings. Buying took place across a variety of sectors. Based on Vickers data, here are select purchases made in 1Q by some high-profile money managers. That ratings shown are from Argus Research. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Director of Research Jim Kelleher, CFA, has surveyed the Argus analyst team about the impact of tariffs on companies in the Argus Universe of Coverage. The tariff environment is dynamic, to say the least. The White House has levied tariffs or threatened to levy tariffs, but often paused, postponed, or withdrawn pledged tariffs. Most recently, China and the U.S. agreed to reduce baseline tariffs to 10% for 90 days (30% in the U.S. reflecting a 20% fentanyl penalty). More than the tariffs themselves, the lack of a finished tariff infrastructure complicates business planning, staffing decisions, and capital investment. Within this dynamic environment, companies are focused on taking actions in areas they can control and planning proactively for a range of tariff scenarios. Companies are anticipating both direct and indirect tariff impacts. Direct impacts would include higher costs for imported finished goods and components, foregone sales as a result of reciprocal tariffs in other nations, and other factors. For example, a manufacturing company would face direct impacts as it pays higher prices for imported parts. Indirect impacts would include a slowing in business related to a broad softening in the economy. All companies likely will feel indirect impacts. A utility, for example, could begin to see a slowing in industrial and commercial kilowatt-hour sales, particularly in niches such as warehousing, trucking and rail, and other freight-related functions. We asked Argus analysts to survey their companies for their commentary on direct and indirect tariff impacts, as well as actions these companies are taking to mitigate the challenging trade environment. Nearly every company in Argus analyst coverage has issued commentary regarding tariffs, much as (five years ago) nearly every company in coverage had something to say about the then-developing COVID-19 pandemic. Below we offer a sampling of company responses to the unfolding tariff environment across a range of sectors and industries. We intend to update our survey on a regular basis at least until the tariff environment, in whatever shape or form, becomes a stable part of the U.S. economy."
  },
  {
    "url": "https://finance.yahoo.com/quote/%5EGSPC/",
    "text": ""
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_3519_AnalystReport_1749466900000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Symbols Sector(s) Financial Services Rating Earnings Estimate Current Price $76.58 Price Target Summary Wells Fargo is one of the largest diversified financial services firms in the United States, with a nationwide network of several thousand branches and a large base of financial advisors. Wells Fargo provides a full range of consumer banking, commercial banking, and investment banki Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Weekly Stock List Jun 09, 2025 • CVX, PSX, COP, KMI, XOM, SLB, SHEL, EOG Technical Assessment: Bullish in the Intermediate-Term Jun 09, 2025 • C, HPE Daily – Vickers Top Buyers & Sellers for 06/05/2025 Jun 05, 2025 • CC, CCOI, STGW, AVPT, AXON, FN, SDHC, ITW, PATK, WMT Technical Assessment: Bullish in the Intermediate-Term Jun 04, 2025 • AXP, VRSK Technical Assessment: Bullish in the Intermediate-Term Jun 03, 2025 • MS, BA Stephen Biggar Director of Financial Institutions Research Stephen is responsible for coverage of large global banks, regional banks and domestic credit card companies. He has covered financial services stocks for more than 20 years. He is also a member of the Argus Investment Policy Committee and Senior Portfolio Group, and frequently appears in print and broadcast media discussing the equity markets. Previously, he was the global director of equity research for S&P Capital IQ. He holds a degree in economics from Rutgers University."
  },
  {
    "url": "https://finance.yahoo.com/quote/WFC/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 248.39B Enterprise Value -- Trailing P/E 13.73 Forward P/E 13.42 PEG Ratio (5yr expected) 1.89 Price/Sales (ttm) 3.18 Price/Book (mrq) 1.53 Enterprise Value/Revenue 5.58 Enterprise Value/EBITDA -- Profit Margin 25.89% Return on Assets (ttm) 1.03% Return on Equity (ttm) 11.02% Revenue (ttm) 77.25B Net Income Avi to Common (ttm) 18.91B Diluted EPS (ttm) 5.56 Total Cash (mrq) 382.28B Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25 Wells Fargo is one of the largest diversified financial services firms in the United States, with a nationwide network of several thousand branches and a large base of financial advisors. Wells Fargo provides a full range of consumer banking, commercial banking, and investment banking services. The company nearly doubled its assets with the acquisition of the former Wachovia. Watching Weekly Claims Wall Street's focus flips back to inflation this week, as key consumer and producer inflation data is due out. Last week, the Dow Jones Industrial Average gained 1.2%, the S&P 500 rose 2.2%, and the Nasdaq popped 1.5%. So far this year, the Dow is up 0.5%, the S&P 2%, and the Nasdaq 1%. Earnings report this week include GameStop, J.M. Smucker, and Dave & Buster's on Tuesday; Oracle and Chewy on Wednesday; and Adobe on Thursday. The final scoreboard for 1Q showed earnings growth of 14%, this after 17% growth in 4Q24 and 9% in 3Q24, according to LSEG. For 1Q, Healthcare was the leading sector, up 46%, while Energy was at the bottom, down 17%. On the economic calendar, Wednesday features the Consumer Price Index, Thursday the Producer Price Index, and Friday an update on Consumer Sentiment. We have adjusted our S&P 500 EPS estimates. For 2025, our forecast for S&P 500 earnings from continuing operations is now $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. Meanwhile, the Economic Call of the Week from Argus Chief Economist Chris Graja, CFA, is the report on Initial Jobless Claims, on which he offered the following. 'Last week's print of 247,000 claims for the week ended May 31 is a wake-up call -- but not a fire alarm. Recent data shows a job market that is solid but slowing. The Unemployment Rate is low and steady at 4.2%. Payrolls rose by a solid 139,000 in May, but growth in March and April was revised lower by a notable 95,000. Is this revision and the increase in unemployment claims an inflection point for the economy? Weekly Jobless Claims, which are regarded as a leading economic indicator, can help make an assessment. Next week's four-week moving average of new filings for unemployment insurance will almost certainly remain below the level of 300,000, the level that raises our fears of a recession. But with nearly 285,000 job cuts announced by the federal government this year and only 59,000 appearing in the monthly employment reports through May, we will take a close look at our forecasts if the four-week average stays above 250,000 for several weeks. Turning to other data, the Atlanta Fed GDPNow forecast is at 3.8% for 2Q. That follows the decline of 0.3% for 1Q. The Cleveland Fed Inflation Nowcast calls for a 2.7% rate for CPI in June, which is higher than the May rate. Mortgage rates inched lower last week, with the average 30-year fixed-rate mortgage at 6.85%, according to FreddieMac. Gas prices ticked down three cents to an average of $3.13 per gallon for regular gas. Looking ahead, the next Fed rate decision is on June 18, with odds at 3% for a rate cut, according to the CME FedWatch rate tool. The next meeting after that is on July 30, and odds for a rate cut have fallen to 16%. Wells Fargo is one of the largest banks in the United States, with approximately $1.9 trillion in balance sheet assets. The company has four primary segments: consumer banking, commercial banking, corporate and investment banking, and wealth and investment management. It is almost entirely focused on the US Wells Fargo is one of the largest banks in the United States, with approximately $1.9 trillion in balance sheet assets. The company has four primary segments: consumer banking, commercial banking, corporate and investment banking, and wealth and investment management. It is almost entirely focused on the US"
  },
  {
    "url": "https://finance.yahoo.com/news/nasdaq-confirms-xrp-sol-ada-173353972.html",
    "text": "Nasdaq confirms XRP, SOL, ADA, and XLM in benchmark index via new SEC filing originally appeared on TheStreet. Nasdaq has officially filed an SEC Form 8-K for the Hashdex Nasdaq Crypto Index US ETF, confirming it has reconstituted its benchmark index to include four new digital assets: Cardano (ADA), Solana (SOL), Stellar Lumens (XLM), and XRP. These coins are now part of the Nasdaq Crypto US Settlement Price Index (NCIUS), which the ETF uses as its benchmark. According to the filing dated June 2, this update marks a significant step toward broader crypto representation in institutional investment products. However, despite the change, the Trust will continue to hold only Bitcoin and Ethereum for now, due to its existing listing restrictions. “Notwithstanding the changes to the NCI US, the Trust will continue to hold only BTC and ETH… due to the limitations of the Trust’s currently approved listing rule,” the filing states. The update was disclosed in a Form 8-K, a standard filing companies use to inform investors of major events that shareholders should know about. In this case, it included the resignation of a key executive, as well as a major index reconstitution that may affect fund tracking performance. The filing warns of tracking error risk, noting: “Beginning on June 2, 2025, the Index introduced additional Index Constituents… Under current regulatory restrictions, the Trust is only permitted to hold bitcoin and ether… As a result, the Trust’s performance may be materially different from the performance of the Index.” Nasdaq has also filed a proposed rule change (SR-NASDAQ-2025-009) with the SEC that would allow the ETF to formally change its benchmark to the broader Nasdaq Crypto Index™ (NCI), enabling it to hold all nine listed crypto assets including LINK, LTC, and UNI. A decision on that proposal is expected by November 2, 2025. Nasdaq confirms XRP, SOL, ADA, and XLM in benchmark index via new SEC filing first appeared on TheStreet on Jun 9, 2025 This story was originally reported by TheStreet on Jun 9, 2025, where it first appeared."
  },
  {
    "url": "https://finance.yahoo.com/news/walmart-ceo-says-customers-feel-170500022.html",
    "text": "Moneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below. Soaring food prices have been hurting consumers for years. But things are coming to a head, especially as retailers and consumers grapple with tariff concerns. Walmart CEO Doug McMillon recently shared at the Economic Club of Chicago that food prices are still elevated — and that consumers are showing signs of \"stress behaviors.\" Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how BlackRock CEO Larry Fink has an important message for the next wave of American retirees — here's how he says you can best weather the US retirement crisis Nervous about the stock market in 2025? Find out how you can access this $1B private real estate fund (with as little as $10) “We worry about that,” McMillon said. “You can see that the money runs out before the month is gone.” McMillon says that shoppers are being more selective in what they buy and are prioritizing value purchases. “There are lots of income levels in this country — if you’re at the lower end of that scale, you are feeling more frustration and pain because of higher food prices,” he said. “They’ve persisted for years now, and you’re just tired of it.\" But what’s the ripple effect behind these price increases? Food prices away from home were up 3.9% broadly year over year in April, while food prices at home were up 2% annually, according to the Consumer Price Index. All told, food prices have shot up nearly 25% since 2020. A big reason for the spike is the supply chain issues caused by severe weather and global events. It hasn't helped that several food staples have been in short supply. In late 2024, a survey by Swiftly found that 70% of American consumers are having difficulty affording groceries. The broader immigration crackdown could also negatively affect food costs, as it might lead to labor shortages that impact supply. With the potential return of tariffs to drive prices up even more, things could get worse before they get better. Unfortunately, consumers may be in for another year of soaring grocery prices. But there are steps you can take to reduce the burden. Planning your week based on what's on sale at your local supermarket is a good idea. Focus on meals that freeze easily — like casseroles and stews. This way, you can whip up a lot of food and have leftovers. Make sure you're signed up for your supermarket's loyalty program. You may qualify for extra discounts, promotions or digital coupons that save you even more."
  },
  {
    "url": "https://finance.yahoo.com/quote/WMT/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 779.85B Enterprise Value 837.74B Trailing P/E 41.65 Forward P/E 37.17 PEG Ratio (5yr expected) 3.72 Price/Sales (ttm) 1.15 Price/Book (mrq) 9.31 Enterprise Value/Revenue 1.22 Enterprise Value/EBITDA 20.37 Profit Margin 2.75% Return on Assets (ttm) 7.15% Return on Equity (ttm) 21.78% Revenue (ttm) 685.09B Net Income Avi to Common (ttm) 18.82B Diluted EPS (ttm) 2.34 Total Cash (mrq) 9.31B Total Debt/Equity (mrq) 75.78% Levered Free Cash Flow (ttm) 9.96B Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Walmart is a leading retailer in the United States, with its strategy predicated on superior operating efficiency and offering the lowest priced goods to consumers to drive robust store traffic and product turnover. Walmart augmented its low-price business strategy by offering a convenient one-stop shopping destination with the opening of its first supercenter in 1988. Today, Walmart operates over 4,600 stores in the United States (5,200 including Sam’s Club) and over 10,000 locations globally. Walmart generated over $460 billion in domestic namesake sales in fiscal 2025, with Sam’s Club contributing another $90 billion to the company's top line. Internationally, Walmart generated $120 billion in sales. The retailer serves around 270 million customers globally each week. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Walmart is the world's largest retailer. In the fiscal year ended January 31, 2025, revenues were $681 billion (compared with Amazon's $637 billion in total revenue). The company has three segments: Walmart Stores, which accounted for about 69% of revenue; Sam's Club, a membership warehouse chain, which comprised 13% of revenue; and the International segment, which generated 18% of sales. The company, based in Bentonville, Arkansas, ended fiscal 2025 with about 10,770 retail units in 19 countries. Groceries are the largest product category in the U.S. market, at approximately 60% of sales. Health and Wellness, another stable category, is 12%. General Merchandise is 26% of sales. Sam's Club gets approximately 65% of sales from Groceries and Consumable products. Global e-commerce sales were almost $108 billion in FY25. The fiscal year ends on January 31 for U.S. and Canadian operations. Other operations generally are consolidated using a one-month lag on a calendar-year basis."
  },
  {
    "url": "https://finance.yahoo.com/m/6a9f9484-312b-371b-b56d-9b2852f24bad/top-funds-savor-this-stock-s.html",
    "text": "As restaurant stocks serve up tasty breakouts, Chili's parent Brinker stock tests a new move of its own, boosted by big growth."
  },
  {
    "url": "https://finance.yahoo.com/m/dd61aa1e-d276-35ea-ad44-2d24c14725c8/intuitive-surgical-stock.html",
    "text": "Deutsche Bank is the first group on Wall Street to issue a Sell rating on shares of Intuitive Surgical."
  },
  {
    "url": "https://finance.yahoo.com/quote/ISRG/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 199.67B Enterprise Value 195.16B Trailing P/E 81.56 Forward P/E 71.43 PEG Ratio (5yr expected) 3.93 Price/Sales (ttm) 23.21 Price/Book (mrq) 11.67 Enterprise Value/Revenue 22.39 Enterprise Value/EBITDA 66.13 Profit Margin 28.41% Return on Assets (ttm) 8.84% Return on Equity (ttm) 15.96% Revenue (ttm) 8.71B Net Income Avi to Common (ttm) 2.48B Diluted EPS (ttm) 6.85 Total Cash (mrq) 4.51B Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) 1.66B Q2'24 Q3'24 Q4'24 Q1'25 Director of Research Jim Kelleher, CFA, has surveyed the Argus analyst team about the impact of tariffs on companies in the Argus Universe of Coverage. The tariff environment is dynamic, to say the least. The White House has levied tariffs or threatened to levy tariffs, but often paused, postponed, or withdrawn pledged tariffs. Most recently, China and the U.S. agreed to reduce baseline tariffs to 10% for 90 days (30% in the U.S. reflecting a 20% fentanyl penalty). More than the tariffs themselves, the lack of a finished tariff infrastructure complicates business planning, staffing decisions, and capital investment. Within this dynamic environment, companies are focused on taking actions in areas they can control and planning proactively for a range of tariff scenarios. Companies are anticipating both direct and indirect tariff impacts. Direct impacts would include higher costs for imported finished goods and components, foregone sales as a result of reciprocal tariffs in other nations, and other factors. For example, a manufacturing company would face direct impacts as it pays higher prices for imported parts. Indirect impacts would include a slowing in business related to a broad softening in the economy. All companies likely will feel indirect impacts. A utility, for example, could begin to see a slowing in industrial and commercial kilowatt-hour sales, particularly in niches such as warehousing, trucking and rail, and other freight-related functions. We asked Argus analysts to survey their companies for their commentary on direct and indirect tariff impacts, as well as actions these companies are taking to mitigate the challenging trade environment. Nearly every company in Argus analyst coverage has issued commentary regarding tariffs, much as (five years ago) nearly every company in coverage had something to say about the then-developing COVID-19 pandemic. Below we offer a sampling of company responses to the unfolding tariff environment across a range of sectors and industries. We intend to update our survey on a regular basis at least until the tariff environment, in whatever shape or form, becomes a stable part of the U.S. economy. Intuitive Surgical develops, produces, and markets a robotic system for assisting minimally invasive surgery. It also provides the instrumentation, disposable accessories, and warranty services for the system. The company has placed more than 9,500 da Vinci systems in hospitals worldwide, with more than 5,500 installations in the US and a growing number in emerging markets. Intuitive Surgical designs, manufactures, and markets da Vinci robotic surgical systems and related instruments and accessories in the U.S. and internationally. The da Vinci system enables surgeons to perform a wide range of surgical procedures with shorter recovery periods and higher patient comfort. ISRG was founded in 1995 and is headquartered in Sunnyvale, California. Stocks are lower at midday on signs that the U.S. economy is slowing faster than expected. For 1Q, consumers and businesses scooped up imports tilting the trade balance and lowering GDP. We got a big hint that this was coming in the Trade Deficit in Goods numbers out yesterday proving the rush to buy imports before expected price increases due to tariffs. The advance estimate for GDP showed a decline of 0.3%, the first contraction in 3 years. Key inflation data out this morning shows the pace of inflation is slowing. Headline PCE slowed to 2.3% in March versus 2.7% the month before. Core PCE decelerated to 2.6% compared to 3.0%. On a month-by-month basis, both measures came in at 0.0% changed. The yield on the 10-year Treasury note is 4.16%. Oil is at $60 per barrel."
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_43758_MarketOutlook_1749466714000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Market Outlook Bullish - Short Summary We have three strategic asset-allocation models, based on risk-tolerance levels: Conservative, Growth, and Aggressive. We make tactical adjustments to the models on a regular basis, based on our outlooks for the various segments of the capital markets. In terms of performance through May, stocks and bonds are neck-and-neck, both with sub-par returns of 1% year to date. Looking ahead from an asset-allocation standpoint, our Stock-Bond Barometer model still slightly favors bonds over stocks for long-term portfolio positioning. In other words, these asset classes should be near their target weights in diversified portfolios, with a slight tilt toward bonds. We are over-weight on large-caps at this stage of the market cycle. We favor large-caps for growth exposure and financial strength, amidst volatility. Our recommended exposure to small- and mid-caps is 10% of equity allocation, below the benchmark weighting. Global stocks have taken an early performance lead in 2025, although U.S. stocks have outperformed their global peers over the trailing one- and five-year periods. We expect the long-term trend favoring U.S. stocks to re-emerge, given volatile global economic, political, geopolitical, and currency conditions. That said, i Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Analyst Report: Nucor Corp. Jun 05, 2025 • NUE Market Digest: NUE, SRE, IQV Jun 05, 2025 • SRE, NUE, IQV Analyst Report: Wynn Resorts, Limited Jun 04, 2025 • WYNN WHR: Raising target price to $85.00 Jun 04, 2025 • WHR NVR: Lowering target price to $7,422.00 Jun 04, 2025 • NVR"
  },
  {
    "url": "https://finance.yahoo.com/quote/TOL/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 10.54B Enterprise Value 12.78B Trailing P/E 7.98 Forward P/E 7.84 PEG Ratio (5yr expected) 0.84 Price/Sales (ttm) 1.03 Price/Book (mrq) 1.33 Enterprise Value/Revenue 1.20 Enterprise Value/EBITDA 6.87 Profit Margin 12.95% Return on Assets (ttm) 8.37% Return on Equity (ttm) 18.06% Revenue (ttm) 10.66B Net Income Avi to Common (ttm) 1.38B Diluted EPS (ttm) 13.45 Total Cash (mrq) 686.47M Total Debt/Equity (mrq) 36.78% Levered Free Cash Flow (ttm) 420.25M Q2'24 Q3'24 Q4'24 Q1'25 We have three strategic asset-allocation models, based on risk-tolerance levels: Conservative, Growth, and Aggressive. We make tactical adjustments to the models on a regular basis, based on our outlooks for the various segments of the capital markets. In terms of performance through May, stocks and bonds are neck-and-neck, both with sub-par returns of 1% year to date. Looking ahead from an asset-allocation standpoint, our Stock-Bond Barometer model still slightly favors bonds over stocks for long-term portfolio positioning. In other words, these asset classes should be near their target weights in diversified portfolios, with a slight tilt toward bonds. We are over-weight on large-caps at this stage of the market cycle. We favor large-caps for growth exposure and financial strength, amidst volatility. Our recommended exposure to small- and mid-caps is 10% of equity allocation, below the benchmark weighting. Global stocks have taken an early performance lead in 2025, although U.S. stocks have outperformed their global peers over the trailing one- and five-year periods. We expect the long-term trend favoring U.S. stocks to re-emerge, given volatile global economic, political, geopolitical, and currency conditions. That said, international stocks offer favorable near-term valuations, and we target an increased 10%-20% of equity exposure to the group. In terms of growth and value, value is off to a good start in 2025 and may continue to outperform in a risk-off environment. Key value sectors that may be less exposed to the global trade wars include Consumer Staples, Healthcare, Utilities, and the regional bank industry within Financial. Toll Brothers is a leading builder of upscale homes, serving step-up, empty-nest, active-adult, and second-home buyers. The company delivered 10,813 homes in FY24. At the end of the fiscal year, the company operated 408 selling communities across 24 states. The company operates its own lumber distribution, component-assembly, and manufacturing operations. Toll also has subsidiaries that provide architectural, engineering, mortgage, title land development and golf course management services. TOL also operates a growing number of for-rent apartments. The company, which is based in Horsham, Pennsylvania, had fiscal FY23 home sales of $10.6 billion, up from $9.9 billion in FY23 and the pre-pandemic record of $7.08 billion in FY19. In April 2022, TOL was the number 4 U.S. homebuilder based on revenue. The company's fiscal year ends on October 31. Stock are mostly hanging on to gains at midday, this after futures initially were solidly higher but then fell on news from ADP that private payrolls grew by just 37,000 in May. That was fewer than the 114,000 expected and below the 60,000 added in April. The result was the smallest increase in private payrolls since March 2023, with the financial press generally blaming uncertainty over trade wars and tariffs. ADP's chief economist noted the following. 'After a strong start to the year, hiring is losing momentum. Pay growth, however, was little changed in May, holding at robust levels for both job-stayers and job-changers.' The weak reading sets up for an even more closely-watched nonfarm payrolls report by the government on Friday. Toll Brothers is the leading luxury homebuilder in the United States with an average sale price well above public competitors'. The company operates in over 60 markets across 24 states and caters to move-up, active-adult, and second-homebuyers. Traditional homebuilding operations represent most of company’s revenue. Toll Brothers also builds luxury for-sale and for-rent properties in urban centers across the US. It has its headquarters in Horsham, Pennsylvania."
  },
  {
    "url": "https://finance.yahoo.com/news/companies-dump-bitcoin-warning-signs-173143464.html",
    "text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below. The cryptocurrency landscape has witnessed a significant shift as corporations increasingly adopt bitcoin as a treasury asset. While this trend has contributed to bitcoin’s recent price surge, it may also be creating new vulnerabilities in the market that warrant careful consideration. Corporate adoption of bitcoin has accelerated notably, with companies following the playbook pioneered by MicroStrategy (NASDAQ:MSTR). According to Bitcoin Treasuries data, 110 publicly listed companies globally now hold bitcoin, representing a substantial institutional commitment to the digital asset. Don't Miss: Trade crypto futures on Plus500 with up to $200 in bonuses — no wallets, just price speculation and free paper trading to practice different strategies. Grow your IRA or 401(k) with Crypto – unlock  the power of alternative investments including a Crypto IRA within your retirement account. Standard Chartered’s analysis focuses on a refined sample of 61 companies that purchase bitcoin purely as a treasury holding, excluding industry participants like miners, exchanges, and service providers. This subset collectively owned nearly 674,000 bitcoins as of May’s end—representing 3.2% of bitcoin’s total 21 million coin supply. The numbers tell a compelling story: these “bitcoin treasuries” have doubled their holdings over just two months, accumulating close to 100,000 additional bitcoins during this period. This buying pressure has been a key factor driving bitcoin to recent all-time highs. However, Standard Chartered’s analysis reveals a concerning dynamic that could eventually reverse this supportive trend. Unlike Strategy, which accumulated bitcoin over time at various price points, many newer corporate entrants have purchased at significantly higher average prices. The bank’s research suggests that approximately half of the monitored corporate treasuries would find themselves underwater if bitcoin fell below $90,000. This creates a potential domino effect where companies that entered the bitcoin treasury strategy during price peaks could become forced sellers during market downturns. The risk stems from several interconnected factors: Purchase Price Disparities: Most corporate treasuries in Standard Chartered’s sample have average purchase prices well above Strategy’s cost basis, making them more vulnerable to market volatility."
  },
  {
    "url": "https://finance.yahoo.com/m/39e17bd8-7259-3386-8571-de67f2384bb0/retailers-rush-to-take.html",
    "text": "U.S. retailers are taking advantage of a temporary reduction in China tariffs to rush in clothes, electronics and seasonal goods. The National Retail Federation’s Global Port Tracker forecasts that importers will bring in the equivalent of 2.01 million ocean shipping containers in June. Jonathan Gold, the NRF’s vice president for supply chain, said retailers are ordering as much merchandise as possible while China tariffs are held at a lower 30% rate through Aug. 12, following a temporary deal between the U.S. and China."
  },
  {
    "url": "https://finance.yahoo.com/m/97cd480b-b389-3e92-b6c4-72ca4d5a764f/the-market-is-vulnerable-6.html",
    "text": "FEATURE The market’s rally brings it to a level that makes it vulnerable to declines. Buying cheap “defensive” stocks is a smart way to protect your portfolio. Last week, in the Trader Column, we pointed out that defensives, broadly, were a good place to start looking for stocks."
  },
  {
    "url": "https://finance.yahoo.com/quote/EXC/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 43.03B Enterprise Value 90.29B Trailing P/E 15.84 Forward P/E 15.85 PEG Ratio (5yr expected) 2.06 Price/Sales (ttm) 1.81 Price/Book (mrq) 1.56 Enterprise Value/Revenue 3.81 Enterprise Value/EBITDA 10.50 Profit Margin 11.44% Return on Assets (ttm) 2.76% Return on Equity (ttm) 10.10% Revenue (ttm) 23.7B Net Income Avi to Common (ttm) 2.71B Diluted EPS (ttm) 2.69 Total Cash (mrq) 1B Total Debt/Equity (mrq) 174.86% Levered Free Cash Flow (ttm) -1.94B Q2'24 Q3'24 Q4'24 Q1'25 Exelon Corp. is a gas and electric utility. It is a leading pure-play energy provider with transmission and distribution operations in the U.S. and headquarters in Chicago. Exelon spun off its generation business in 2022, which was about 60% nuclear, as Constellation Energy. Constellation is now a publicly traded company (CEG) focused on generation and competitive distribution, while Exelon focuses on regulated transmission and distribution. Exelon shares were repriced as a result of this separation. As of the beginning of 2025, Exelon has about 9.2 million electric customers and 1.4 million gas customers through its six regulated utility subsidiaries. Its service regions are primarily in central Maryland (Baltimore Gas & Electric Co.), northern Illinois (ComEd), and southeastern Pennsylvania (PECO). Revenues in 2024 were about $23 billion. Of 2024 adjusted operating earnings, about 45% were from ComEd and 30% from PHI. The company aims to cut emissions by 50% by 2030 and to achieve net-zero emissions by 2050. The shares are a component of the S&P 500. Exelon's market cap is about $44 billion. Stocks are lower at Friday midday. President Trump says that China is not adhering to trade agreements in place. A fresh economic report shows price inflation slowing. The Personal Consumption Expenditures index printed at 2.1% for April compared to 2.3% in March. Core PCE was 2.5% versus 2.6%. Still sticky - housing and utility costs. Consumers are spending more on that category, by nearly $50 billion year-over-year. We come back next week to June. The Jobs report is out next Friday. Argus still expects that report to show a healthy labor market. The yield on the 10-year Treasury note is 4.43%. Oil is at $61 per barrel. Exelon serves approximately 10 million power and gas customers at its six regulated utilities in Illinois, Pennsylvania, Maryland, New Jersey, Delaware, and Washington, D.C. Exelon serves approximately 10 million power and gas customers at its six regulated utilities in Illinois, Pennsylvania, Maryland, New Jersey, Delaware, and Washington, D.C."
  },
  {
    "url": "https://finance.yahoo.com/m/083323de-2df5-3507-830d-b0d5995ba994/the-s-p-500-is-near-a-record-.html",
    "text": "With the S&P 500 in striking distance of a record close, the index could post a historic recovery. The S&P 500 was up 0.1% to 6006.29 on Monday, which is off around 2% from its Feb. 19 record close. It may feel like ages since the S&P was cruising to record highs, but its latest milestone was only 76 trading days ago."
  },
  {
    "url": "https://finance.yahoo.com/news/stellantis-offers-voluntary-redundancy-scheme-163627489.html",
    "text": "(Refiles to fix typo in plant's name) MILAN (Reuters) -Stellantis has started a voluntary redundancy plan for 610 workers at its Mirafiori plant in Turin, Italy, after introducing the scheme at other Italian facilities, the automaker said on Monday. Stellantis is so far cutting up to 1,600 staff in total across Italy this year through the voluntary redundancy scheme. At Mirafiori, the scheme \"is aimed at supporting early retirement or different career opportunities,\" a company spokesperson said, adding workers at Mirafiori can sign up for it until the end of July. The Mirafiori plant will have a stable workforce from August to prepare for the launch of the new hybrid version of the Fiat 500 city car, the spokesperson said. Full-scale production of the new model is expected to start in November. Luigi Paone of Uilm, one of the unions which agreed the voluntary redundancy plan with Stellantis, said it would be aimed at workers closer to retirement age. The plan \"should serve to pave the way for the hiring of young workers as we approach the production start-up of the hybrid 500,\" Paone said. Between April and May Stellantis agreed similar packages at other assembly plants in Italy, including Melfi and Pomigliano, for a total workforce reduction of up to 1,660 workers this year. The company has fewer than 40,000 staff in Italy, down from 55,000 in early 2021 when the group was created through the merger of Fiat Chrysler and Peugeot maker PSA. (Reporting by Giulio Piovaccari; Editing by Susan Fenton)"
  },
  {
    "url": "https://finance.yahoo.com/quote/STLAM.MI/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nFTSE MIB Index (FTSEMIB.MI)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 24.98B Enterprise Value 25.13B Trailing P/E 4.71 Forward P/E 4.27 PEG Ratio (5yr expected) 0.28 Price/Sales (ttm) 0.16 Price/Book (mrq) 0.31 Enterprise Value/Revenue 0.16 Enterprise Value/EBITDA 1.97 Profit Margin 3.49% Return on Assets (ttm) 1.92% Return on Equity (ttm) 6.72% Revenue (ttm) 156.88B Net Income Avi to Common (ttm) 5.47B Diluted EPS (ttm) 1.84 Total Cash (mrq) 35.39B Total Debt/Equity (mrq) 45.36% Levered Free Cash Flow (ttm) -3.98B Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_43755_MarketSummary_1749466000000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Sector(s) Financial Services, Technology, Consumer Cyclical Summary Watching Weekly Claims Wall Street's focus flips back to inflation this week, as key consumer and producer inflation data is due out. Last week, the Dow Jones Industrial Average gained 1.2%, the S&P 500 rose 2.2%, and the Nasdaq popped 1.5%. So far this year, the Dow is up 0.5%, the S&P 2%, and the Nasdaq 1%. Earnings report this week include GameStop, J.M. Smucker, and Dave & Buster's on Tuesday; Oracle and Chewy on Wednesday; and Adobe on Thursday. The final scoreboard for 1Q showed earnings growth of 14%, this after 17% growth in 4Q24 and 9% in 3Q24, according to LSEG. For 1Q, Healthcare was the leading sector, up 46%, while Energy was at the bottom, down 17%. On the economic calendar, Wednesday features the Consumer Price Index, Thursday the Producer Price Index, and Friday an update on Consumer Sentiment. We have adjusted our S&P 500 EPS estimates. For 2025, our forecast for S&P 500 earnings from continuing operations is now $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. Meanwhile, the Economic Call of the Week from Argus Chief Economist Chris Graja, CFA, is the report on Initial Jobless Claims, on which he offered the following. 'Last week's print of 247,000 claims for the week ended May 31 is a wake-up call -- but not a fire alarm. Recent data shows a job market that is solid but slowing. The Unemployment Rate is low and steady at 4.2%. Payrolls rose by a solid 139,000 in May, but growth in March and April was revised lower by a notable 95,000. Is this revision and the increase in unemployment claims an inflection point for the economy? Weekly Jobless Claims, which are regarded as a leading economic indicator, can help make an assessment. Next week's four-week moving average of new filings for unemployment insurance will almost certainly remain below the level of 300,000, the level that raises our fears of a recession. But with nearly 285,000 job cuts announced by the federal government this year and only 59,000 appearing in the monthly employment reports through May, we will take a c Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Weekly Stock List Jun 09, 2025 • CVX, PSX, COP, KMI, XOM, SLB, SHEL, EOG Technical Assessment: Bullish in the Intermediate-Term Jun 09, 2025 • C, HPE Analyst Report: Microsoft Corporation Jun 07, 2025 • MSFT Analyst Report: American International Group, Inc. Jun 07, 2025 • AIG Technical Assessment: Bullish in the Intermediate-Term Jun 06, 2025 • IBM, AIG"
  },
  {
    "url": "https://finance.yahoo.com/quote/DOCU/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 15.24B Enterprise Value 14.43B Trailing P/E 14.31 Forward P/E 20.88 PEG Ratio (5yr expected) -- Price/Sales (ttm) 5.24 Price/Book (mrq) 7.57 Enterprise Value/Revenue 4.76 Enterprise Value/EBITDA 36.01 Profit Margin 36.50% Return on Assets (ttm) 4.41% Return on Equity (ttm) 70.20% Revenue (ttm) 3.03B Net Income Avi to Common (ttm) 1.11B Diluted EPS (ttm) 5.26 Total Cash (mrq) 948.69M Total Debt/Equity (mrq) 6.60% Levered Free Cash Flow (ttm) 1.14B Q2'24 Q3'24 Q4'24 Q1'25 DocuSign Inc. provides electronic signature or e-signature tools, enabling users to digitally sign and send agreements securely through a wide variety of devices. The company initially served the U.S. market, but has expanded internationally (primarily in Canada, the UK, Australia, and Japan) and now has customers in 187 countries. It generates 28% of its revenue outside the U.S. DocuSign completed its initial public offering in April 2018 at $29 per share. Watching Weekly Claims Wall Street's focus flips back to inflation this week, as key consumer and producer inflation data is due out. Last week, the Dow Jones Industrial Average gained 1.2%, the S&P 500 rose 2.2%, and the Nasdaq popped 1.5%. So far this year, the Dow is up 0.5%, the S&P 2%, and the Nasdaq 1%. Earnings report this week include GameStop, J.M. Smucker, and Dave & Buster's on Tuesday; Oracle and Chewy on Wednesday; and Adobe on Thursday. The final scoreboard for 1Q showed earnings growth of 14%, this after 17% growth in 4Q24 and 9% in 3Q24, according to LSEG. For 1Q, Healthcare was the leading sector, up 46%, while Energy was at the bottom, down 17%. On the economic calendar, Wednesday features the Consumer Price Index, Thursday the Producer Price Index, and Friday an update on Consumer Sentiment. We have adjusted our S&P 500 EPS estimates. For 2025, our forecast for S&P 500 earnings from continuing operations is now $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. Meanwhile, the Economic Call of the Week from Argus Chief Economist Chris Graja, CFA, is the report on Initial Jobless Claims, on which he offered the following. 'Last week's print of 247,000 claims for the week ended May 31 is a wake-up call -- but not a fire alarm. Recent data shows a job market that is solid but slowing. The Unemployment Rate is low and steady at 4.2%. Payrolls rose by a solid 139,000 in May, but growth in March and April was revised lower by a notable 95,000. Is this revision and the increase in unemployment claims an inflection point for the economy? Weekly Jobless Claims, which are regarded as a leading economic indicator, can help make an assessment. Next week's four-week moving average of new filings for unemployment insurance will almost certainly remain below the level of 300,000, the level that raises our fears of a recession. But with nearly 285,000 job cuts announced by the federal government this year and only 59,000 appearing in the monthly employment reports through May, we will take a close look at our forecasts if the four-week average stays above 250,000 for several weeks. Turning to other data, the Atlanta Fed GDPNow forecast is at 3.8% for 2Q. That follows the decline of 0.3% for 1Q. The Cleveland Fed Inflation Nowcast calls for a 2.7% rate for CPI in June, which is higher than the May rate. Mortgage rates inched lower last week, with the average 30-year fixed-rate mortgage at 6.85%, according to FreddieMac. Gas prices ticked down three cents to an average of $3.13 per gallon for regular gas. Looking ahead, the next Fed rate decision is on June 18, with odds at 3% for a rate cut, according to the CME FedWatch rate tool. The next meeting after that is on July 30, and odds for a rate cut have fallen to 16%. Docusign offers Agreement Cloud, a broad cloud-based software suite that enables users to automate the agreement process and provide legally binding e-signatures from nearly any device. The company was founded in 2003 and completed its initial public offering in 2018. Docusign offers Agreement Cloud, a broad cloud-based software suite that enables users to automate the agreement process and provide legally binding e-signatures from nearly any device. The company was founded in 2003 and completed its initial public offering in 2018."
  },
  {
    "url": "https://finance.yahoo.com/m/922b20cb-0ca2-3e1c-8b1b-88ef3eb1e4b2/tech-media-telecom.html",
    "text": "Find insights on Trustpilot , Qualcomm’s bid for Alphawave, Dassault Systemes, and more in the latest Market Talks involving the Technology, Media and Telecommunications sectors."
  },
  {
    "url": "https://finance.yahoo.com/m/30ad010e-beae-35ca-91bf-a0894626bfba/energy-utilities-roundup-.html",
    "text": "Find insight on Gulf Development, Mahanagar Gas and more in the latest Market Talks covering energy and utilities."
  },
  {
    "url": "https://finance.yahoo.com/m/7efd0b9d-5134-3ab2-9244-d111390e2ab1/financial-services-roundup-.html",
    "text": "0821 ET – Newly public online broker eToro can stand apart from other e-brokers, Deutsche Bank analyst Brian Bedell says. The bank’s case is based more on return on tangible equity improvement and rerating than on accretion to per share metrics from share buybacks, Joseph Dickerson and Theo Massing write."
  },
  {
    "url": "https://finance.yahoo.com/news/keybanc-initiates-coverage-zoom-communications-161836417.html",
    "text": "Zoom Communications Inc. (NASDAQ:ZM) is one of the 10 tech stocks on Wall Street’s radar right now. On June 6, KeyBanc initiated coverage of Zoom Communications Inc. (NASDAQ:ZM) with an Underweight rating and set a $73 price target in a broader report on select Enterprise Software companies. The analyst noted that the company’s core video conferencing business has faced challenges since the pandemic peak, as in-person work returned. The firm also mentioned the competitive pressure from Microsoft as it has strengthened its position with Teams, improving features and user experience. Keybanc said that the company’s efforts to grow beyond video collaboration have not been very compelling. A close-up of a hand using a laptop to control an immersive video meeting. Similarly, on May 22, Wells Fargo increased its price target on Zoom Communications Inc. (NASDAQ:ZM) from $75 to $80 and maintained an Equal Weight rating on the stock. The stock was already trading around $2 above the analyst’s price target on the day. Zoom (NASDAQ:ZM) provides an AI-driven work platform featuring video meetings, messaging, cloud phone systems, and productivity tools like whiteboards, workflow automation, and modular docs, while also supporting virtual events, contact centers, and third-party app integration across various industries. While we acknowledge the potential of ZM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/ZM/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 24.31B Enterprise Value 16.58B Trailing P/E 24.13 Forward P/E 14.35 PEG Ratio (5yr expected) -- Price/Sales (ttm) 5.38 Price/Book (mrq) 2.73 Enterprise Value/Revenue 3.53 Enterprise Value/EBITDA 16.86 Profit Margin 22.31% Return on Assets (ttm) 5.02% Return on Equity (ttm) 12.19% Revenue (ttm) 4.7B Net Income Avi to Common (ttm) 1.05B Diluted EPS (ttm) 3.33 Total Cash (mrq) 7.79B Total Debt/Equity (mrq) 0.69% Levered Free Cash Flow (ttm) 1.78B Q2'24 Q3'24 Q4'24 Q1'25 Zoom Video Communications is a video-first, cloud-native scalable communications system for enterprises designed to facilitate video, voice, chat, and content-sharing across devices and locations through its Zoom Meetings and Zoom Phone applications. Zoom was founded in 2011 and completed its initial public offering on April 18, 2019 at $36 per share. Zoom derives about 20% of revenue from outside the U.S. Stock are mostly hanging on to gains at midday, this after futures initially were solidly higher but then fell on news from ADP that private payrolls grew by just 37,000 in May. That was fewer than the 114,000 expected and below the 60,000 added in April. The result was the smallest increase in private payrolls since March 2023, with the financial press generally blaming uncertainty over trade wars and tariffs. ADP's chief economist noted the following. 'After a strong start to the year, hiring is losing momentum. Pay growth, however, was little changed in May, holding at robust levels for both job-stayers and job-changers.' The weak reading sets up for an even more closely-watched nonfarm payrolls report by the government on Friday. This first-quarter earnings season has had a special tone. As usual, many companies have offered guidance. But they also have increasingly focused on the economy, tariffs, and overall uncertainty. On tariffs specifically, managements are detailing any likely impact on profits and any plans to pass price hikes on to customers and/or consumers. Our team of analysts is factoring all this fresh data into sector outlooks, earnings forecasts, and investment ratings. We track the list of companies raising guidance, and this quarter that list often features companies in sectors such as Communication Services, Consumer Discretionary, Consumer Staples, Healthcare, Industrial, and Information Technology. Often missing are companies the Financials, Energy, and Materials sectors. Companies that are still able to raise guidance despite the tariff and macroeconomic uncertainty could feature managements that have flexibility in a changing environment, and that is often a catalyst for market-beating returns. Indeed, \"Management Signals\" is one of our Investment Themes for 2025. The following is a list of some of the companies in our Fundamental Universe of Coverage where management recently increased guidance. Zoom Video Communications provides a communications platform that connects people through video, voice, chat, and content sharing. The company’s cloud-native platform enables face-to-face video and connects users across various devices and locations in a single meeting. Zoom, which was founded in 2011 and is headquartered in San Jose, California, serves companies of all sizes from all industries around the world."
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_43753_InsiderActivity_1749465929000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Sector(s) Communication Services, Utilities, Financial Services, Energy, Technology, Real Estate, Healthcare, Consumer Defensive Summary The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase historie Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Weekly Stock List Jun 09, 2025 • CVX, PSX, COP, KMI, XOM, SLB, SHEL, EOG Analyst Report: Wells Fargo & Co. Jun 09, 2025 • WFC Technical Assessment: Bullish in the Intermediate-Term Jun 09, 2025 • C, HPE Market Digest: CBRL, WFC, TSLA, BHF, DOCU Jun 09, 2025 • BHF, TSLA, WFC, CBRL, DOCU Analyst Report: Eli Lilly and Company Jun 07, 2025 • LLY"
  },
  {
    "url": "https://finance.yahoo.com/quote/WEST/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 638.83M Enterprise Value 1.42B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.71 Price/Book (mrq) 8.95 Enterprise Value/Revenue 1.63 Enterprise Value/EBITDA -- Profit Margin -9.61% Return on Assets (ttm) -2.09% Return on Equity (ttm) -23.58% Revenue (ttm) 872.02M Net Income Avi to Common (ttm) -83.5M Diluted EPS (ttm) -0.91 Total Cash (mrq) 33.05M Total Debt/Equity (mrq) 185.67% Levered Free Cash Flow (ttm) -146.53M Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months."
  },
  {
    "url": "https://finance.yahoo.com/quote/GROV/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 53.14M Enterprise Value 90.07M Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.26 Price/Book (mrq) -- Enterprise Value/Revenue 0.47 Enterprise Value/EBITDA -- Profit Margin -14.26% Return on Assets (ttm) -15.76% Return on Equity (ttm) -180.03% Revenue (ttm) 193.43M Net Income Avi to Common (ttm) -28.65M Diluted EPS (ttm) -0.7600 Total Cash (mrq) 9.61M Total Debt/Equity (mrq) 165.85% Levered Free Cash Flow (ttm) 1.15M Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months."
  },
  {
    "url": "https://finance.yahoo.com/news/b-riley-raises-price-target-161744437.html",
    "text": "Silicon Motion Technology Corporation (NASDAQ:SIMO) is one of the 10 tech stocks on Wall Street’s radar right now. On June 5, B.Riley increased its price target on Silicon Motion Technology Corporation (NASDAQ:SIMO) to $90 from $75 and reaffirmed its Buy rating on the stock. The firm pointed to the expanded Nvidia Bluefield DPU win and the upcoming Nintendo Switch 2 cycle as drivers of longer-term gains for the company. It further added that progress in the PCIe Gen5 PC and notebook market is on track, with Silicon Motion (NASDAQ:SIMO) projected to grow its market share to over 50% using its 8- and 4-channel products. Additionally, B.Riley provided a bullish outlook on the company’s future earnings as it said that similar momentum is expected from the adoption of UFS 4.0 in smartphones. The developments could push estimated earnings per share in 2026 and 2027 to around $5.25 and $6.50, respectively. An engineer in a lab coat tweaking a circuit board with intricate semiconductors. During the company’s Q1 2025 earnings call, management highlighted that Silicon Motion (NASDAQ:SIMO) has partnered with NVIDIA for over a year to qualify its MonTitan server boot storage for the BlueField-3 DPU, a platform designed to optimize AI workloads and cloud networking. Starting later this year, its boot storage will support BlueField-3, creating new revenue and growth opportunities. Silicon Motion (NASDAQ:SIMO) designs and sells NAND flash controllers and specialized SSDs for various applications, including computing, enterprise data centers, mobile devices, and industrial uses, under multiple brand names. While we acknowledge the potential of SIMO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/SIMO/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nMSCI WORLD (^990100-USD-STRD)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 2.28B Enterprise Value 2.01B Trailing P/E 24.66 Forward P/E 20.16 PEG Ratio (5yr expected) -- Price/Sales (ttm) 2.90 Price/Book (mrq) 2.95 Enterprise Value/Revenue 2.57 Enterprise Value/EBITDA 15.90 Profit Margin 12.06% Return on Assets (ttm) 5.34% Return on Equity (ttm) 12.34% Revenue (ttm) 780.73M Net Income Avi to Common (ttm) 94.17M Diluted EPS (ttm) 2.72 Total Cash (mrq) 275.14M Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) 45.48M Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/news/northland-raises-ciena-cien-price-161728739.html",
    "text": "Ciena Corporation (NYSE:CIEN) is one of the 10 tech stocks on Wall Street’s radar right now. Northland analyst Tim Savageaux increased the price target on Ciena Corporation (NYSE:CIEN) to $85 from $75 and maintained an Outperform rating on June 6, after the company reported “mixed” fiscal Q2 results. Savageaux highlighted the strong demand that led to raising the FY25 growth forecast to 14%, up from the previous 8-11% range. He also pointed out that in the Optical industry, it is common to buy systems providers when margins are lower due to higher line system and equipment revenue. A team of telecom engineers discussing a communication infrastructure diagram. While Northland showed a bullish sentiment on the stock, Evercore ISI analyst Amit Daryanani cut the price target for Ciena (NYSE:CIEN) to $75 from $82 and maintained an In Line rating on the same day. According to the firm, the recent quarter showed mixed results, with revenue beating estimates but earnings per share falling short. Growth in the cloud segment drove revenue, but weaker gross margins, affected by product mix and tariffs, hurt profits, and the analyst noted that margin challenges continue to be a worry. Ciena (NYSE:CIEN) delivers a broad range of hardware, software, and services focused on optical networking, network management, and automation, supporting network operators with solutions for transport, routing, orchestration, and maintenance. While we acknowledge the potential of CIEN as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/CIEN/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 10.28B Enterprise Value 10.61B Trailing P/E 99.62 Forward P/E 27.47 PEG Ratio (5yr expected) -- Price/Sales (ttm) 2.48 Price/Book (mrq) 3.70 Enterprise Value/Revenue 2.49 Enterprise Value/EBITDA 27.67 Profit Margin 2.46% Return on Assets (ttm) 2.29% Return on Equity (ttm) 3.70% Revenue (ttm) 4.26B Net Income Avi to Common (ttm) 104.8M Diluted EPS (ttm) 0.73 Total Cash (mrq) 1.25B Total Debt/Equity (mrq) 57.22% Levered Free Cash Flow (ttm) 329.16M Q2'24 Q3'24 Q4'24 Q1'25 Ciena participates in optical transport and switching, converged optical Ethernet solutions, carrier Ethernet, and global services for its customers. The addition of Nortel MEN in March 2010 more than doubled the revenue base. Ciena operates in three segments: Network Platforms, representing 75%-80% of revenue; Software & Related Services, 6%-8% of revenue; and Global Services, 12%-14% of revenue. U.S. stocks fell on tension between Elon Musk and President Trump over the tax and spending bill. Tesla (TSLA) plummeted 14%. The Nasdaq was down 0.8%, the S&P 500 fell 0.5% and the Dow slipped 0.3%. Treasury yields held steady. Despite bursts of outperformance, small- and mid-cap stocks (SMID) have underperformed large-caps year to date -- as they have over the past five years. But they may be in a better position to generate market-beating returns going forward. For one thing, SMID companies tend to focus on domestic markets, so their businesses could be less disrupted by the trade and tariff debate, or fallout from unrest in the Middle East, the Russian invasion of Ukraine, issues in China, or other geopolitical developments. As well, the prices of SMID stocks generally are lower than the prices of large-caps. Finally, there are long stretches in the record books when SMID stocks have outperformed large-caps. SMID stocks can be risky, but despite those risks, diversified investors look to have exposure to small- and mid-caps based on the long-term performance record. We estimate that 20% of the U.S. stock market's capitalization is comprised of SMID stocks. Ciena participates in optical transport and switching, converged optical Ethernet solutions, carrier Ethernet, and global services for its customers. The addition of Nortel MEN in March 2010 more than doubled the revenue base. Ciena operates in three segments: Network Platforms, representing 75%-80% of revenue; Software & Related Services, 6%-8% of revenue; and Global Services, 12%-14% of revenue."
  },
  {
    "url": "https://finance.yahoo.com/news/oppenheimer-raises-price-target-cloudflare-161713682.html",
    "text": "Cloudflare, Inc. (NYSE:NET) is one of the 10 tech stocks on Wall Street’s radar right now. On June 5, Oppenheimer raised its price target on Cloudflare, Inc. (NYSE:NET) from $165 to $200 and maintained an Outperform rating after discussions with Phil Winslow, the company’s VP of Strategic Finance & Investor Relations. The firm grew more optimistic about the company’s growth prospects due to strong momentum in SASE (Secure Access Service Edge) security, boosted by Magic WAN adoption and improvements in CASB (Cloud Access Security Broker) and data loss prevention security features. The firm noted that the Worker platform’s expanding capabilities have gained more traction among developers who favor the shift-left approach. Additionally, new AI-focused edge computing technologies like MCP and A2A, along with a new container service for AI workloads, are also some of the reasons for Oppenheimer’s positive outlook. The firm is confident that Cloudflare (NYSE:NET) will exceed expectations for 2025, accelerate revenue growth beyond 30%, and reach a $5 billion ARR by the end of 2028. A close-up of a server array powering a cloud-services system. Cloudflare (NYSE:NET) provides a broad suite of cloud-based security, performance, and network services designed to protect and optimize applications, websites, and data across platforms, including SaaS, IoT, and cloud environments. The company offers security solutions including zero trust and DDoS protection, network services such as Magic WAN, and developer tools alongside consumer products like VPN and DNS services. While we acknowledge the potential of NET as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/NET/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 62.28B Enterprise Value 61.84B Trailing P/E -- Forward P/E 222.22 PEG Ratio (5yr expected) -- Price/Sales (ttm) 34.84 Price/Book (mrq) 43.68 Enterprise Value/Revenue 34.93 Enterprise Value/EBITDA 870.94 Profit Margin -4.62% Return on Assets (ttm) -2.64% Return on Equity (ttm) -7.35% Revenue (ttm) 1.77B Net Income Avi to Common (ttm) -81.71M Diluted EPS (ttm) -0.23 Total Cash (mrq) 1.91B Total Debt/Equity (mrq) 103.51% Levered Free Cash Flow (ttm) 56.59M Q2'24 Q3'24 Q4'24 Q1'25 Cloudflare is a software company based in San Francisco, California, that offers security and web performance offerings by utilizing a distributed, serverless content delivery network, or CDN. The firm’s edge computing platform, Workers, leverages this network by providing clients the ability to deploy, and execute code without maintaining servers. Earnings season is mostly over and so far, according to FactSet, 78% of S&P 500 (SPX) companies have beat EPS estimates and 63% beat revenue estimates. So was it too early for tariffs to take a bite? There are some big reports still to come, including arguably the biggest (Nvidia) after the close on Wednesday. Other reports come from OKTA, DKS, ANF, CRM, HPQ, SNPS, VEEV, BBY, COST, DELL, MRVL, ZS, ULTA, and NTAP, with CRWD and AVGO next week. Stock futures were nicely higher over the weekend as President Trump agreed to a deadline extension (until July 9) with the European Union over tariffs. So with last week's mild selloff, and the SPX kissing its 200-day from above for the first time since early March, it's possible that another leg higher is about to kick in. This next advancing phase could take the major indices back to their all-time highs from December 2024 (Nasdaq) and February 2025 (SPX and Nasdaq 100). A move to the prior highs or possibly to new all-time highs would set the majors up for a decent pullback and a much-needed rest. What continues to confound us (and is quite bullish) is that many professional and individual investors have dug in their heels and remain neutral or bearish. Indeed, the recent powerful move higher, the breadth thrusts, and the constructive headlines have not been enough to convert the masses. We have heard for months that stocks remain vulnerable until the tariff situation is resolved. But if you wait for a problem to be totally solved, you could very well miss a good portion of any recovery. (Mark Arbeter, CMT) Cloudflare provides cloud-based network services that protect internet apps and help them to run faster -- without requiring clients to add hardware, install new software, or change code. Cloudflare's unified control plane across on-premise, cloud, hybrid, and SaaS data infrastructure environments ensures the security, reliability, and performance of its enterprise customers' external data infrastructure (websites, applications, and application program interfaces); internal networks and devices (identity and access); DevOps; and consumer applications. Internet sites powered by Cloudflare have all web traffic routed through its intelligent global network. The company seeks to relieve clients of the cost and complexity of managing their own network hardware. Some 48% of the company's revenue is generated outside of the U.S. Cloudflare was founded in 2010 and went public on September 12, 2019, at $15 per share. Stocks are mixed at Tuesday midday with the Nasdaq up more than 1% while the Dow is lower. Inflation slowed last month in the first measure showing the possible impact of President Trump's tariffs. CPI came in at 2.3% for April year-over-year compared to 2.4% in March. On a month-over-month basis, prices increased 0.2%, above the 0.1% decrease seen in March but lower than the 0.3% expected by economists. Core CPI was 2.8% for April matching March. The yield on the 10-year Treasury note is 4.47%. Oil is up 1% at $63 per barrel."
  },
  {
    "url": "https://finance.yahoo.com/news/macquarie-raises-mongodb-mdb-pt-161649729.html",
    "text": "MongoDB, Inc. (NASDAQ:MDB) is one of the 10 tech stocks on Wall Street’s radar right now. Macquarie increased its price target on MongoDB, Inc. (NASDAQ:MDB) to $230 from $215 and maintained a Neutral rating on June 6. The firm noted that the company’s strong first-quarter performance helped ease concerns after last quarter’s weak full-year revenue and margin outlook. Macquarie believes potential gains and risks are currently in balance. On June 4, MongoDB (NASDAQ:MDB) reported first-quarter results that exceeded expectations, with adjusted earnings of $1.00 per share and $549 million in revenue, both topping estimates by $0.34 and $21.53 million, respectively. The company added 2,600 new customers, reaching over 57,100 total. MongoDB Atlas revenue grew 26% year-over-year and made up 72% of total revenue. A software engineer hosting a remote video training session on a multi-cloud database-as-a-service solution. The company’s management raised full-year revenue guidance by $10 million to $2.25–$2.29 billion and operating margin to 12%, while expanding the share repurchase program to $1 billion. For the second quarter, MongoDB (NASDAQ:MDB) guided its revenue toward the $548 million-$553 million range. The latest results presented a sharp turnaround from the prior quarter’s conservative outlook, which had driven the stock down nearly 30%. MongoDB (NASDAQ:MDB) provides a flexible database platform that includes a cloud-based service, enterprise-grade solutions, and a free version for developers, along with consulting and training services. While we acknowledge the potential of MDB as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/MDB/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 17.99B Enterprise Value 15.57B Trailing P/E -- Forward P/E 72.99 PEG Ratio (5yr expected) -- Price/Sales (ttm) 8.01 Price/Book (mrq) 5.93 Enterprise Value/Revenue 7.40 Enterprise Value/EBITDA -- Profit Margin -4.09% Return on Assets (ttm) -3.19% Return on Equity (ttm) -4.00% Revenue (ttm) 2.1B Net Income Avi to Common (ttm) -86.11M Diluted EPS (ttm) -1.10 Total Cash (mrq) 2.45B Total Debt/Equity (mrq) 2.38% Levered Free Cash Flow (ttm) 421.32M Q2'24 Q3'24 Q4'24 Q1'25 MongoDB provides an advanced scalable general purpose database or data management software platform. The MongoDB database is used by enterprises to develop applications that are at the heart of modern enterprise technology. MongoDB uses hybrid open-source and proprietary technology as the basis for its 'freemium' software business model. MongoDB was founded in November 2007 and made its initial public offering at $24 per share on October 19, 2017. About 46% of the company's revenue is generated outside the U.S. Original investors and insiders hold more than 95% of voting control through their supervoting (10 votes per share) Class B shares. The major stocks indices are higher at midday on Friday, riding a jobs report this morning that matched the Argus estimate while beating the overall Street consensus. For now, it appears that hiring is still happening even with the headwind of tariff uncertainty. As well, a reported calming in the war of words between President Trump and Elon Musk reassured those who saw that brouhaha as having a possible significant negative impact on current events. Founded in 2007, MongoDB is a document-oriented database. MongoDB provides both licenses as well as subscriptions as a service for its NoSQL database. MongoDB’s database is compatible with all major programming languages and is capable of being deployed for a variety of use cases. Founded in 2007, MongoDB is a document-oriented database. MongoDB provides both licenses as well as subscriptions as a service for its NoSQL database. MongoDB’s database is compatible with all major programming languages and is capable of being deployed for a variety of use cases."
  },
  {
    "url": "https://finance.yahoo.com/research/reports/ARGUS_43754_TopBottomInsiderActivity_1749465029000?yptr=yahoo&ncid=yahooproperties_plusresear_nm5q6ze1cei",
    "text": "Argus • Jun 09, 2025 Sector(s) Financial Services, Technology, Healthcare, Consumer Defensive, Industrials, Consumer Cyclical Summary The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest Exclusive reports, detailed company profiles, and best-in-class trade insights to take your portfolio to the next level Technical Assessment: Bullish in the Intermediate-Term Jun 09, 2025 • C, HPE Morningstar | A Weekly Summary of Stock Ideas and Developments in the Companies We Cover Jun 07, 2025 • DE, AYI, CRSP, PVH, CPB, WM, HON, RSG, EMR, SMG, ROK Analyst Report: Hewlett Packard Enterprise Co Jun 06, 2025 • HPE Market Update: CENT, GAP, THO, HPE, MDB Jun 06, 2025 • CENT, GAP, THO, MDB, HPE Analyst Report: CIENA Corp. Jun 06, 2025 • CIEN"
  },
  {
    "url": "https://finance.yahoo.com/quote/ABL/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 579.62M Enterprise Value 901.90M Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 3.55 Price/Book (mrq) 1.35 Enterprise Value/Revenue 6.70 Enterprise Value/EBITDA 38.19 Profit Margin -13.35% Return on Assets (ttm) 2.42% Return on Equity (ttm) -6.07% Revenue (ttm) 134.58M Net Income Avi to Common (ttm) -17.97M Diluted EPS (ttm) -0.27 Total Cash (mrq) 43.76M Total Debt/Equity (mrq) 82.89% Levered Free Cash Flow (ttm) 43.06M Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/quote/ABLLW/",
    "text": "Add holdings Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap -- Enterprise Value -- Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) -- Price/Book (mrq) -- Enterprise Value/Revenue -- Enterprise Value/EBITDA -- Profit Margin -- Return on Assets (ttm) -- Return on Equity (ttm) -- Revenue (ttm) -- Net Income Avi to Common (ttm) -- Diluted EPS (ttm) -- Total Cash (mrq) -- Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/news/setco-automotive-launches-water-pump-170802173.html",
    "text": "Setco Automotive, known for manufacturing MHCV clutches, has launched its automotive water pump, marking a strategic move into the engine cooling market. This product is designed to meet the demands of light commercial vehicles (LCVs) and medium and heavy commercial vehicles (MHCVs), offering superior seal integrity, high load-bearing capability, and enhanced NVH isolation performance. The thermal-optimised impeller material grade further ensures durability and efficiency. It has a durable seal, high load capacity, improved noise and vibration reduction, and a heat-resistant impeller material. This new product is engineered to deliver exceptional performance, even under strenuous conditions, and is manufactured using advanced materials and precision techniques. It is designed to ensure optimal coolant circulation and maintain thermal stability across diverse operating environments. Setco Automotive chairman & MD Harish Sheth said: “This launch is a significant step in our journey to diversify and deepen our presence across the auto component value chain. Our new Automotive Water Pump reflects the same quality, performance, and engineering excellence that has made Setco the benchmark in the clutch segment. \"With this product, we aim to deliver superior engine protection and performance, while strengthening our relationships with OEMs and aftermarket customers alike.” Setco Automotive was established in 1982, and has a range of products including brake linings, clutches, flywheels, flywheel ring gears, lubricants, clutch release bearing assemblies, centre support bearings, coolant, and universal joint crosses. With five manufacturing units, Setco Automotive boasts an extensive product range of over 100 products. \"Setco Automotive launches new water pump for commercial vehicles\" was originally created and published by Just Auto, a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site."
  },
  {
    "url": "https://finance.yahoo.com/news/keybanc-initiates-coverage-twilio-twlo-161615177.html",
    "text": "Twilio Inc. (NYSE:TWLO) is one of the 10 tech stocks on Wall Street’s radar right now. On June 6, KeyBanc initiated coverage of Twilio Inc. (NYSE:TWLO) with a $146 price target and an Overweight rating as part of the firm’s broader look at enterprise software stocks. The firm noted that the company’s recent momentum could continue, which could be driven by a sharper focus on its main products and improvements in its go-to-market execution. Over the last month, Twilio’s (NYSE:TWLO) stock has gained nearly 15.7%. A software developer in front of a monitor, coding to build the latest internet content & information. Earlier on May 14, Baird analyst William Power reaffirmed a Buy rating on Twilio (NYSE:TWLO) with a $130 price target. The firm had previously cut the price target for the company in April from $160 to $130. Power’s view shows confidence in the company’s progress in conversational AI and its collaboration with Microsoft. Moreover, tools like ConversationRelay and its integration with Segment are seen as Twilio’s (NYSE:TWLO) main strengths. The company’s platform upgrades, including new AI and customer data features, signal strong innovation. Twilio (NYSE:TWLO) provides a platform that helps businesses manage customer interactions through messaging, voice, email, and user verification. Furthermore, the company offers tools to personalize experiences using real-time data and AI features. While we acknowledge the potential of TWLO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/TWLO/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 18.59B Enterprise Value 17.24B Trailing P/E -- Forward P/E 27.47 PEG Ratio (5yr expected) -- Price/Sales (ttm) 4.28 Price/Book (mrq) 2.32 Enterprise Value/Revenue 3.76 Enterprise Value/EBITDA 75.48 Profit Margin -0.74% Return on Assets (ttm) 0.16% Return on Equity (ttm) -0.39% Revenue (ttm) 4.58B Net Income Avi to Common (ttm) -34.04M Diluted EPS (ttm) -0.23 Total Cash (mrq) 2.45B Total Debt/Equity (mrq) 13.75% Levered Free Cash Flow (ttm) 698.69M Q2'24 Q3'24 Q4'24 Q1'25 This first-quarter earnings season has had a special tone. As usual, many companies have offered guidance. But they also have increasingly focused on the economy, tariffs, and overall uncertainty. On tariffs specifically, managements are detailing any likely impact on profits and any plans to pass price hikes on to customers and/or consumers. Our team of analysts is factoring all this fresh data into sector outlooks, earnings forecasts, and investment ratings. We track the list of companies raising guidance, and this quarter that list often features companies in sectors such as Communication Services, Consumer Discretionary, Consumer Staples, Healthcare, Industrial, and Information Technology. Often missing are companies the Financials, Energy, and Materials sectors. Companies that are still able to raise guidance despite the tariff and macroeconomic uncertainty could feature managements that have flexibility in a changing environment, and that is often a catalyst for market-beating returns. Indeed, \"Management Signals\" is one of our Investment Themes for 2025. The following is a list of some of the companies in our Fundamental Universe of Coverage where management recently increased guidance. Twilio is a cloud-based communications platform-as-a-service company offering communication building blocks that allow for a fully customized customer engagement experience spanning voice, video, chat, and SMS messaging. It does this through various application programming interfaces and prebuilt solution applications aimed at improving customer engagement. The company leverages its Super Network, a global network of carrier relationships, to facilitate high-speed, cost-effective communication. Twilio provides a cloud-based communications platform that enables businesses to embed messaging, voice, video, and authentication capabilities directly into their software applications. The company's platform allows developers to build and manage applications without the complexity of creating and maintaining underlying infrastructure. It completed its initial public offering in June 2016. Many brokerage firms that serve retail and institutional clients maintain data to measure investment sentiment. This can be very valuable when evaluating how the small investor, or even the corporate giants, are feeling about the stock market - and, more importantly, what are they doing with their funds. Charles Schwab is one of those firms, with its Schwab Trading Activity Index, or STAX. STAX is a proprietary, behavior-based index designed to indicate the sentiment of retail investors and has been incorporating data since January 2019. In April, STAX fell to 41.2, down 15% from 48.4 in March and the lowest headline reading since April 2023. The STAX fell every week of the April period, though the first week saw the heaviest selling as STAX fell 11%, the biggest weekly drop since the first week of April 2023. The third week of the four saw only mild net-selling, but selling accelerated again in the final week (ended April 25). On a monthly basis, April's overall STAX plunge of 14.9% was the deepest drop since March 2020, the first full month of the COVID-19 pandemic. This is just another example of what we have been talking about for weeks, namely the similarity between 2025's correction and the pandemic correction. The current STAX reading is closing in on the low level of 37.2 at the end of 2022, right after that bear market bottomed. During the 2023/2024 market advance, the index never got out of neutral territory, peaking at 55."
  },
  {
    "url": "https://finance.yahoo.com/news/oppenheimer-increases-snowflake-snow-pt-161533478.html",
    "text": "Snowflake Inc. (NASDAQ:SNOW) is one of the 10 tech stocks on Wall Street’s radar right now. On June 6, Oppenheimer raised Snowflake Inc.’s (NASDAQ:SNOW) price target to $250 from $225, while maintaining an Outperform rating. As the firm revised the company’s price target, it pointed toward Snowflake’s Summit’25, which took place in the first week of June. Its keynote speakers included some well-known faces, including Sridhar Ramaswamy, Sam Altman, and Sarah Guo. Oppenheimer noted that the event emphasized stronger data lifecycle support, faster product development, and entry into transactional workloads following the Crunchy Data acquisition. Snowflake (NASDAQ:SNOW) announced at the event that it plans to acquire Crunchy Data, a leading open-source Postgres provider, to launch Snowflake Postgres, which is an enterprise-grade PostgreSQL database tailored for AI applications. A software engineer at work, surrounded by a wall of computer monitors connected to a 'Data Cloud' platform. Oppenheimer’s data shows that customer feedback revealed rising adoption of Snowflake due to its user-friendly platform. The firm believes the company’s broader product range reflects stronger execution and adaptability, which encourages customers to store more data and develop more applications on its platform. Snowflake (NASDAQ:SNOW) offers a cloud-based data platform that helps organizations centralize their data to generate insights, develop data applications, share data products, and apply AI to address business challenges. While we acknowledge the potential of SNOW as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/SNOW/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 70.35B Enterprise Value 69.13B Trailing P/E -- Forward P/E 188.68 PEG Ratio (5yr expected) 12.55 Price/Sales (ttm) 18.26 Price/Book (mrq) 29.21 Enterprise Value/Revenue 18.00 Enterprise Value/EBITDA -- Profit Margin -36.43% Return on Assets (ttm) -11.56% Return on Equity (ttm) -40.14% Revenue (ttm) 3.84B Net Income Avi to Common (ttm) -1.4B Diluted EPS (ttm) -4.20 Total Cash (mrq) 3.91B Total Debt/Equity (mrq) 111.30% Levered Free Cash Flow (ttm) 1.16B Q2'24 Q3'24 Q4'24 Q1'25 This first-quarter earnings season has had a special tone. As usual, many companies have offered guidance. But they also have increasingly focused on the economy, tariffs, and overall uncertainty. On tariffs specifically, managements are detailing any likely impact on profits and any plans to pass price hikes on to customers and/or consumers. Our team of analysts is factoring all this fresh data into sector outlooks, earnings forecasts, and investment ratings. We track the list of companies raising guidance, and this quarter that list often features companies in sectors such as Communication Services, Consumer Discretionary, Consumer Staples, Healthcare, Industrial, and Information Technology. Often missing are companies the Financials, Energy, and Materials sectors. Companies that are still able to raise guidance despite the tariff and macroeconomic uncertainty could feature managements that have flexibility in a changing environment, and that is often a catalyst for market-beating returns. Indeed, \"Management Signals\" is one of our Investment Themes for 2025. The following is a list of some of the companies in our Fundamental Universe of Coverage where management recently increased guidance. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Snowflake is a cloud-native data warehouse company. The company leverages the large public hyperscale cloud services to provide its Data Cloud to customers, enabling them to unify disparate data sources for the purposes of data engineering, and the development of artificial intelligence, applications, collaboration, and cybersecurity. Snowflake went public on September 16, 2020 at $120 per share. The company derives 23% of its revenue outside the U.S. In this commentary last week, we described the weekly insider-sentiment data from Vickers Stock Research as being stable after multiple weeks of bullish movement. This week, the song remains very much the same. Mirroring the sentiment in the broader market of late, insiders appear to think it is unlikely that share prices will convincingly recapture all-time high territory -- but also don't seem inclined to believe another steep drop is imminent. It is hard to manage a business on 90-day mandates, and similarly hard to invest for the long-term with ongoing volatility in the news cycle. End of day, the current eight-week sentiment barometers from Vickers fall in line a follows (with any ratio below 2.00 bullish and any ratio between 2.00 and 6.00 neutral). The NYSE Eight-Week Sell/Buy Ratio is now 2.04, neutral and slightly worse than last week; the Nasdaq Eight-Week Sell/Buy Ratio is now 2.66, neutral and slightly better than last week; and the Total (all exchanges) Eight-Week Sell/Buy Ratio is now 2.30, neutral and flat with last week. Insider selling outpaced insider buying across all sectors over the last week, but insider buying in the Industrial sector lagged selling by a factor of just 2.7-times. Selling was the greatest in Consumer Discretionary over the last week, with shares valued at $458 million sold versus less than $2 million bought. Selling was also notable in Information Technology, with shares valued at $259 million sold versus just over $2 million bought. This week, analysts at Vickers highlighted insider transactions of interest at The Middleby Corp. (NGS: MIDD) and Microsoft Corp. (NGS: MSFT)."
  },
  {
    "url": "https://finance.yahoo.com/m/e11538f0-3880-3420-9f3a-2f2ed0ed3903/this-cathie-wood-stock-breaks.html",
    "text": "Cameco supplies uranium to major utilities but also has exposure to new nuclear technology and standard nuclear reactors."
  },
  {
    "url": "https://finance.yahoo.com/quote/OKLO/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 7.02B Enterprise Value 6.82B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) -- Price/Book (mrq) 26.05 Enterprise Value/Revenue -- Enterprise Value/EBITDA -- Profit Margin 0.00% Return on Assets (ttm) -22.83% Return on Equity (ttm) -56.03% Revenue (ttm) -- Net Income Avi to Common (ttm) -59.4M Diluted EPS (ttm) -0.47 Total Cash (mrq) 201.02M Total Debt/Equity (mrq) 0.67% Levered Free Cash Flow (ttm) -24.09M Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions."
  },
  {
    "url": "https://finance.yahoo.com/quote/VST/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 58.91B Enterprise Value 78.51B Trailing P/E 27.52 Forward P/E 25.19 PEG Ratio (5yr expected) 5.42 Price/Sales (ttm) 3.36 Price/Book (mrq) 25.08 Enterprise Value/Revenue 4.34 Enterprise Value/EBITDA 11.58 Profit Margin 13.40% Return on Assets (ttm) 6.30% Return on Equity (ttm) 41.68% Revenue (ttm) 18.1B Net Income Avi to Common (ttm) 2.23B Diluted EPS (ttm) 6.30 Total Cash (mrq) 589M Total Debt/Equity (mrq) 366.14% Levered Free Cash Flow (ttm) 2.79B Q2'24 Q3'24 Q4'24 Q1'25 VISTRA CORP has an Investment Rating of HOLD; a target price of $185.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium. Vistra Energy is one of the largest power producers and retail energy providers in the US. Following the 2024 Energy Harbor acquisition, Vistra owns 41 gigawatts of nuclear, coal, natural gas, solar, and energy storage assets. The proposed Lotus Partners acquisition would add 2.6 GW of natural gas generation. Its retail electricity business serves 5 million customers in 20 states, including almost a third of all Texas electricity consumers. Vistra emerged from the Energy Future Holdings bankruptcy as a stand-alone entity in 2016. It acquired Dynegy in 2018. VISTRA CORP has an Investment Rating of HOLD; a target price of $172.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium. VISTRA CORP has an Investment Rating of HOLD; a target price of $165.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium."
  },
  {
    "url": "https://finance.yahoo.com/news/mizuho-raises-micron-mu-pt-161508319.html",
    "text": "Micron Technology, Inc. (NASDAQ:MU) is one of the 10 tech stocks on Wall Street’s radar right now. On June 5, Mizuho raised its price target for Micron Technology, Inc. (NASDAQ:MU) to $130 from $124 and maintained an Outperform rating ahead of the company’s FQ3 ’25 earnings report. The firm expects industry-high bandwidth memory revenue to grow 55% yearly through 2027. Additionally, the company’s high bandwidth memory revenue is projected to increase 90% annually due to market share gains, reaching 45% of its DRAM revenue, which could increase sales and margins. A close-up view of a computer motherboard with integrated semiconductor chips. On the same day, UBS increased its price target for Micron (NASDAQ:MU) from $92 to $120 while maintaining a Buy rating. The analyst pointed toward a more favorable outlook and reduced concerns over tariffs as reasons for the revision. Micron (NASDAQ:MU) develops and sells advanced memory and storage products, including DRAM and non-volatile semiconductor devices, and it serves a wide range of markets such as data centers, PCs, mobile devices, and automotive. While we acknowledge the potential of MU as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/MU/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 121.32B Enterprise Value 128.06B Trailing P/E 25.97 Forward P/E 10.16 PEG Ratio (5yr expected) 0.15 Price/Sales (ttm) 3.91 Price/Book (mrq) 2.49 Enterprise Value/Revenue 4.09 Enterprise Value/EBITDA 8.71 Profit Margin 14.92% Return on Assets (ttm) 5.52% Return on Equity (ttm) 10.10% Revenue (ttm) 31.32B Net Income Avi to Common (ttm) 4.67B Diluted EPS (ttm) 4.18 Total Cash (mrq) 8.22B Total Debt/Equity (mrq) 30.89% Levered Free Cash Flow (ttm) -607.25M Q2'24 Q3'24 Q4'24 Q1'25 Micron is one of the largest semiconductor companies in the world, specializing in memory and storage chips. Its primary revenue stream comes from dynamic random access memory, or DRAM, and it also has minority exposure to not-and or NAND, flash chips. Micron serves a global customer base, selling chips into data centers, mobile phones, consumer electronics, and industrial and automotive applications. The firm is vertically integrated. Micron is one of the largest semiconductor companies in the world, specializing in memory and storage chips. Its primary revenue stream comes from dynamic random access memory, or DRAM, and it also has minority exposure to not-and or NAND, flash chips. Micron serves a global customer base, selling chips into data centers, mobile phones, consumer electronics, and industrial and automotive applications. The firm is vertically integrated. Boise, Idaho-based Micron is the largest U.S. memory company and a leading global supplier of DRAM, NOR and NAND memory. The company provides memory solutions for computing, communications, consumer, and industrial applications, and serves both wireless and embedded applications. In July 2013, Micron completed its acquisition of Elpida and the Rexchip assets, resulting in a significant boost to productive capacity and revenue opportunity. The major indices are higher are midday, led by the Nasdaq which is up more than 2% as of this writing. Stocks are getting some relief as tariffs continue to take form, but might be tempered. Looking ahead, a fresh read on inflation is coming this week. The yield on the 10-year Treasury note is around 4.33%. Oil is near $69 per barrel. Bitcoin is up almost 4% and over $88,000."
  },
  {
    "url": "https://finance.yahoo.com/news/zf-secures-uk-wales-government-170340207.html",
    "text": "ZF Automotive UK, a supplier of car parts to global brands, has been granted £432,000 from the Welsh Government's Economy Futures Fund to optimise its operations. This investment will help safeguard over 60 jobs at the company's Pontypool facility, which specialises in manufacturing brake callipers. The funding is set to modernise a production line dedicated to fulfilling a contract with Jaguar Land Rover (JLR). This initiative will not only boost productivity but also provide ZF Automotive UK's workforce with valuable opportunities to acquire new skills pertinent to advanced manufacturing processes. ZF Automotive UK Operations director Steven McKenzie said: “Our team in Pontypool is passionately working to continually improve our manufacturing operations, to ensure competitiveness in a challenging automotive sector. “This funding will support our efforts to purchase equipment and tooling to secure new business, in addition to supporting our heating project to significantly improve our energy efficiency.” Moreover, the investment will facilitate the creation of apprenticeship and graduate positions, further contributing to the local economy and job market. Cabinet Secretary for Economy, Energy and Planning Rebecca Evans said: “ZF Automotive is a well established and important employer for Pontypool and the surrounding area with many long serving staff. \"The funding will help the business decarbonise and optimise its operations, bringing highly sought after contracts with Jaguar Land Rover to Wales and upskilling staff as a result.” In addition to workforce development, ZF Automotive UK plans to utilise the funds to replace its outdated gas heating system, which has been in operation for over 50 years. The upgrade is expected to enhance energy efficiency at the site, leading to a substantial reduction in carbon emissions. ZF Friedrichshafen’s sales for the fiscal year 2024 declined 11% from the previous year’s €46.6bn to €41.4bn. The company said the decline was primarily due to the deconsolidation of its axle assembly product line, which was transferred to the ZF Foxconn Chassis Modules joint venture in April 2024. Looking ahead to 2025, ZF Group anticipates only weak economic growth in the eurozone and Germany, with vehicle markets potentially staying below previous year levels. In February, ZF Group announced that it had commenced series production of its state-of-the-art steer-by-wire system. It eliminates the need for a mechanical connection between the steering wheel and steering gear, is being implemented in Nio Inc's flagship ET9 model, a Chinese battery electric vehicle (BEV)."
  },
  {
    "url": "https://finance.yahoo.com/news/truist-increases-broadcom-avgo-pt-161439354.html",
    "text": "Broadcom Inc. (NASDAQ:AVGO) is one of the 10 tech stocks on Wall Street’s radar right now. On June 6, Truist analyst William Stein increased his price target on Broadcom Inc. (NASDAQ:AVGO) to $295 from $267 and maintained a Buy rating after the company posted solid results for FQ2 2025. The firm noted that the stock dipped due to limited immediate AI upside, compared to investor expectations. However, Stein believes that Broadcom’s (NASDAQ:AVGO) long-term AI outlook remains strong and expects new customer gains to be a prospect for future growth. The company reported strong Q2 results, with adjusted earnings per share of $1.58 and revenue of $15 billion, which was a 20% year-over-year growth. The company posted $10 billion in adjusted EBITDA, which represented 67% of revenue, and generated $6.4 billion in free cash flow. For the third quarter, the company projects revenue around $15.8 billion and expects adjusted EBITDA to reach at least 66% of that total. A technician working at a magnified microscope, developing a new integrated circuit. Broadcom (NASDAQ:AVGO) has transitioned from a traditional semiconductor company into a core provider of AI infrastructure. Despite a pullback after earnings, AI revenue surged 46% year-over-year to $4.4 billion, supported by strong networking demand, while non-AI semiconductor and infrastructure software segments were weaker. However, strong momentum is projected into Q3. Broadcom (NASDAQ:AVGO) develops and supplies advanced semiconductor devices and software solutions used across a wide range of technologies, including AI networking, wireless connectivity, storage systems, and industrial automation. The company’s products support important functions in consumer electronics, data centers, and communication infrastructure. While we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock. READ NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money. Disclosure: None."
  },
  {
    "url": "https://finance.yahoo.com/quote/AVGO/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 1.16T Enterprise Value 1.22T Trailing P/E 90.05 Forward P/E 37.88 PEG Ratio (5yr expected) 0.66 Price/Sales (ttm) 20.90 Price/Book (mrq) 16.69 Enterprise Value/Revenue 21.37 Enterprise Value/EBITDA 40.30 Profit Margin 22.64% Return on Assets (ttm) 7.95% Return on Equity (ttm) 18.98% Revenue (ttm) 57.05B Net Income Avi to Common (ttm) 13.24B Diluted EPS (ttm) 2.74 Total Cash (mrq) 11.11B Total Debt/Equity (mrq) 166.03% Levered Free Cash Flow (ttm) 26.03B Q2'24 Q3'24 Q4'24 Q1'25 Broadcom is the sixth-largest semiconductor company globally and has expanded into various software businesses, with over $30 billion in annual revenue. It sells 17 core semiconductor product lines across wireless, networking, broadband, storage, and industrial markets. It is primarily a fabless designer but holds some manufacturing in-house, like for its best-of-breed FBAR filters that sell into the Apple iPhone. In software, it sells virtualization, infrastructure, and security software to large enterprises, financial institutions, and governments. Broadcom is the product of consolidation. Its businesses are an amalgamation of former companies like legacy Broadcom and Avago Technologies in chips, as well as Brocade, CA Technologies, and Symantec in software. Broadcom is the sixth-largest semiconductor company globally and has expanded into various software businesses, with over $30 billion in annual revenue. It sells 17 core semiconductor product lines across wireless, networking, broadband, storage, and industrial markets. It is primarily a fabless designer but holds some manufacturing in-house, like for its best-of-breed FBAR filters that sell into the Apple iPhone. In software, it sells virtualization, infrastructure, and security software to large enterprises, financial institutions, and governments. Broadcom is the product of consolidation. Its businesses are an amalgamation of former companies like legacy Broadcom and Avago Technologies in chips, as well as Brocade, CA Technologies, and Symantec in software. Sustainable Impact Investing is gaining traction not only with Argus Research clients but also with the global investment community. As assets have flowed in over the past 40 years, Sustainable Investing has evolved. The discipline, originally known as Socially Responsible Investing, first focused on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. In time, the list of industries to avoid increased to include soft drinks, fast food, and oil and gas, among numerous others. Performance of initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights. Given the strategy's focus on leading management practices, we expect the growth curve for Sustainable Investing to again slope upward in the years ahead. Broadcom is the sixth-largest semiconductor company globally and has expanded into various software businesses, with over $30 billion in annual revenue. It sells 17 core semiconductor product lines across wireless, networking, broadband, storage, and industrial markets. It is primarily a fabless designer but holds some manufacturing in-house, like for its best-of-breed FBAR filters that sell into the Apple iPhone. In software, it sells virtualization, infrastructure, and security software to large enterprises, financial institutions, and governments. Broadcom is the product of consolidation. Its businesses are an amalgamation of former companies like legacy Broadcom and Avago Technologies in chips, as well as Brocade, CA Technologies, and Symantec in software."
  },
  {
    "url": "https://finance.yahoo.com/news/roku-inc-roku-bull-case-160928936.html",
    "text": "We came across a bullish thesis on Roku, Inc. (ROKU) on The Finance Corner’s Substack by Kostadin Ristovski. In this article, we will summarize the bulls’ thesis on ROKU. Roku, Inc. (ROKU)'s share was trading at $74.6 as of 5th June. Close up of a hand holding a tablet device with video services streaming. Roku, much like the classic razor-and-blades model, has positioned itself as a hardware gateway to a highly monetizable software ecosystem. Initially launched in 2008 to support Netflix, Roku began with low-cost streaming devices, eventually expanding into a broad lineup of physical products—from smart TVs and speakers to home accessories—sold at a loss to attract users. The real value lies in the Roku OS, which it licenses freely to TV manufacturers like TCL and Hisense, enabling Roku to grow its user base without owning hardware production. This feeds into its true moneymaker: the platform business. The Roku Channel, launched in 2017, now features over 80,000 titles and more than 500 live channels, all of which are ad-supported. The company also earns by taking cuts from streaming subscriptions and charging content providers for distribution and prominence. Unlike content-heavy rivals, Roku remains content-agnostic, focusing on being the go-to aggregator and ad platform in the streaming value chain. Strategic acquisitions in data analytics, content, and ad tech have strengthened this positioning. While Roku isn't profitable yet due to the drag from its hardware division and rapid pandemic-era expansion, its platform gross margin stands at 54%, and the company holds $1.7B in net cash. International growth, ad innovation (including shoppable ads via Walmart), and potential new verticals, such as gaming, suggest that revenue can continue to grow at a rate of nearly 10% annually. Despite trading near its estimated fair value, Roku presents a compelling case due to operating leverage, potential margin expansion, and even acquisition interest. Investors face dilution risks and limited governance, but the long-term digital ad tailwinds remain highly attractive. Previously, we covered a bullish thesis on Roku by LongYield in May 2025, which aligns with Kostadin Ristovski’s June 2025 view. The stock has since then appreciated by approximately 23%. Both highlight Roku’s high-margin platform business and ad monetization strength. LongYield focuses on improving financials, guidance, and recent acquisitions, while Ristovski emphasizes Roku’s razor-and-blades model, OS distribution, and long-term operating leverage. The theses reinforce each other but differ in focus—one near-term execution, the other strategic positioning."
  },
  {
    "url": "https://finance.yahoo.com/m/2a3a8e18-39d6-3683-80bb-cd35e924c9cd/solar-bellwether%E2%80%99s-bankruptcy.html",
    "text": "One of America’s largest rooftop-solar installation businesses filed for chapter 11 Monday, a stark illustration of the strains haunting the U.S. clean-energy sector as shifting federal policies shake investor confidence."
  },
  {
    "url": "https://finance.yahoo.com/quote/NOVA/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 27.68M Enterprise Value 8.28B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 0.03 Price/Book (mrq) 0.02 Enterprise Value/Revenue 9.85 Enterprise Value/EBITDA 52.95 Profit Margin -43.80% Return on Assets (ttm) -1.29% Return on Equity (ttm) -18.60% Revenue (ttm) 839.92M Net Income Avi to Common (ttm) -367.89M Diluted EPS (ttm) -2.9600 Total Cash (mrq) 211.19M Total Debt/Equity (mrq) 316.04% Levered Free Cash Flow (ttm) -1.44B Q1'24 Q2'24 Q3'24 Q4'24 The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months. The Vickers Top Insider Picks is a daily report that utilizes a proprietary algorithm to identify 25 companies with compelling insider purchase histories based on transactions over the past three months."
  },
  {
    "url": "https://finance.yahoo.com/m/90272a67-3d8a-3216-b5ef-2933a54b260f/these-stocks-are-moving-the.html",
    "text": "Tesla trades lower ahead of the possible launch of its robotaxi service this week in Austin, Texas, while Apple’s annual Worldwide Developers Conference begins Monday."
  },
  {
    "url": "https://finance.yahoo.com/news/6-stock-market-terms-ll-170207009.html",
    "text": "If you’re brand-new to investing, all the terminology related to the stock market can be off-putting. Instead of learning what feels like a new language, you might feel overwhelmed and hold off on investing. However, many stock market and general investing terms are much simpler than they seem at first glance. If you keep an open mind, you might be surprised how quickly you can learn the lingo and gain confidence investing. Read Next: 12 Best Safe Investments To Grow Your Money in 2025 Explore More: 8 Common Mistakes Retirees Make With Their Social Security Checks Here are some examples of stock market terms that you should know and aren’t as complex as they might sound. Also see eight tips to invest in stocks for beginners. You might see headlines about stock market volatility or hear about the volatility of a particular stock, and while it might seem like something to fear, it’s not necessarily something to run from. “The term volatility can often scare newer and even experienced investors because it is often associated with negative events, but the meaning itself is quite simple. Volatility means how much a stock goes up and down,” said Nicole Carlon, CFP, wealth management advisor at WiseOak Wealth. And not all stocks are the same in terms of volatility. “Some stocks may be more volatile than others. This means the price of the stock will go up and down more often than one that is less volatile. It does not mean that one stock is better than the other, but that the value fluctuates more. It’s up to the investor how much fluctuation they feel they can handle,” Carlon explained. Check Out: Suze Orman: 3 Biggest Mistakes You Can Make as an Investor Another key term to know is diversification, as it’s typically an important part of managing risk. “Diversification sounds to the average investor like a complicated strategy, but in layman’s terms it means not putting all of your eggs in one basket,” Carlon said. “Essentially, an investor would buy positions in multiple categories — stocks, bonds, real estate, etc. — instead of using all their funds to only buy one stock. The general concept is that if the money is spread into different positions and one does poorly, the others will hopefully do better to balance the account out.” You might hear an advisor ask you about your investment horizon or see this term come up in contexts like retirement planning. The good news is that it’s a pretty simple term that typically aligns with certain investing practices. “The investment horizon refers to the period during which you expect to keep your money invested before needing to use it. It can be short-term (less than a year), such as a down payment or a car; medium-term (a few years), like college expenses for kids in five years; or long-term (10-20 years or more), like retirement,” said Jon Knotts, chief investment officer at Expressive Wealth."
  },
  {
    "url": "https://finance.yahoo.com/news/harmony-biosciences-holdings-inc-hrmy-160846565.html",
    "text": "We came across a bullish thesis on Harmony Biosciences Holdings, Inc. (HRMY) on Capital Curiosity’s Substack by Taylor Nichols. In this article, we will summarize the bulls’ thesis on HRMY. Harmony Biosciences Holdings, Inc. (HRMY)'s share was trading at $35.03 as of 5th June. HRMY’s trailing and forward P/E were 13.37 and 9.45 respectively according to Yahoo Finance. Copyright: zneb076 / 123RF Stock Photo Harmony Biosciences stands out as an overlooked gem in the small-cap biotech space, combining strong financials with pipeline potential in a niche therapeutic area. With a $2 billion market cap and a focus on rare neurological diseases, Harmony's flagship drug WAKIX for narcolepsy has underpinned impressive fundamentals—35% revenue CAGR since 2020, 25% net margins, and consistent free cash flow conversion above 30%. Despite these metrics, the stock trades at just 13x earnings and an EV/EBITDA of 7.9x, reflecting investor scepticism largely tied to single-product dependency and unresolved legal risks from 2023 fraud allegations. Still, Harmony boasts over $480 million in cash, negligible debt, and a stable share count, which enhances confidence in long-term shareholder returns. While WAKIX remains the core revenue driver, the company is aggressively diversifying through M&A, including the Zynerba and Epygenix acquisitions, bringing promising assets like ZYN002 for Fragile X Syndrome into the pipeline. Phase 3 data expected in Q3 2025 could catalyze upside, alongside the development of Pitolisant HD and other preclinical candidates. A DCF valuation incorporating conservative assumptions yields share prices between $38 and $62, implying a substantial upside from current levels. Analyst sentiment is bullish, with eight of nine recent ratings being buys and a $51 average price target. Although risks like competition from Jazz Pharmaceuticals, FDA hurdles, and prolonged legal overhang remain, Harmony’s profitability, cash strength, and strategic execution offer investors a compelling asymmetrical opportunity. For those seeking exposure to a profitable, underappreciated rare disease player with both pipeline and financial momentum, Harmony merits close attention. Previously, we covered a bullish thesis on Harmony Biosciences by Long-Access-2143 in April 2025, which aligns with Taylor Nichols’ analysis. The stock has seen an appreciation of approximately 13% since then. Both highlight WAKIX’s strength and undervaluation, while Long-Access-2143 stresses the mispricing post short-seller attack and details a WAKIX-driven DCF, Nichols places more emphasis on pipeline expansion and cash strength. Together, they reinforce Harmony’s appeal as a profitable, underappreciated biotech."
  },
  {
    "url": "https://finance.yahoo.com/quote/HRMY/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 2.04B Enterprise Value 1.71B Trailing P/E 13.59 Forward P/E 9.61 PEG Ratio (5yr expected) -- Price/Sales (ttm) 2.78 Price/Book (mrq) 2.84 Enterprise Value/Revenue 2.30 Enterprise Value/EBITDA 7.20 Profit Margin 20.50% Return on Assets (ttm) 12.81% Return on Equity (ttm) 24.71% Revenue (ttm) 744.85M Net Income Avi to Common (ttm) 152.72M Diluted EPS (ttm) 2.62 Total Cash (mrq) 506.95M Total Debt/Equity (mrq) 24.63% Levered Free Cash Flow (ttm) 143.41M Q2'24 Q3'24 Q4'24 Q1'25 HARMONY BIOSCIENCES HOLDINGS has an Investment Rating of BUY; a target price of $46.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of High; a Growth Subrating of Medium; and a Value Subrating of Medium. HARMONY BIOSCIENCES HOLDINGS has an Investment Rating of BUY; a target price of $44.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High. HARMONY BIOSCIENCES HOLDINGS has an Investment Rating of BUY; a target price of $46.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of High. HARMONY BIOSCIENCES HOLDINGS has an Investment Rating of BUY; a target price of $45.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of High; a Growth Subrating of Medium; and a Value Subrating of High."
  },
  {
    "url": "https://finance.yahoo.com/news/irsa-inversiones-y-representaciones-sociedad-160811531.html",
    "text": "We came across a bullish thesis on IRSA Inversiones y Representaciones Sociedad Anónima (IRS) on From 0 to 1 in the Stock Market’s Substack by Giuliano. In this article, we will summarize the bulls’ thesis on IRS. IRSA Inversiones y Representaciones Sociedad Anónima (IRS)'s share was trading at $ 14.63 as of 5th June. IRS’s trailing P/E was 7.83 according to Yahoo Finance. Aerial view of a shopping mall bustling with consumers. Irsa presents a compelling opportunity as a deeply misunderstood Argentinian real estate operator trading well below the intrinsic value of its high-quality, cash-generating portfolio. At its core, Irsa owns and operates a diversified mix of shopping malls, office buildings, hotels, and development land, mostly in and around Buenos Aires. Following a five-year corporate simplification, including the 2021 merger with its subsidiary Irsa CP, management has focused on increasing operational efficiency, reducing its office footprint, and redirecting capital into core assets like retail. Irsa’s 16 malls encompass 370,000 sqm of GLA, generating consistent tenant sales and achieving occupancy rates above 94%. Its dual rent model—base rent plus a variable sales-linked fee—allows income to scale as the economy improves. Despite Argentina’s turmoil, mall gross margins have averaged 90%, with normalized operating margins of 70–75%, reflecting both asset quality and prudent management. Recent capital deployments affirm the company’s reinvestment discipline. In August 2024, Irsa acquired a parcel adjacent to Alto Avellaneda for $12.2M, with the potential to add $3.47M in after-tax profit plus $1.15M in non-rental income. In December, Irsa announced the acquisition of Terrazas de Mayo, a mall with 33,720 sqm of GLA and an estimated 7 million annual visitors, adding further depth to its portfolio. The company’s selective expansion strategy has historically yielded durable returns, underpinned by long asset lives and prime locations. Meanwhile, Irsa has actively reduced its office footprint from 115,000 to 59,000 sqm since 2018, monetizing non-core holdings while adding premium inventory like the Della Paollera tower. Its hotel segment, with three long-held properties, rebounded strongly in FY24 with $45M in revenue and a 29% operating margin, supported by resilient domestic and affluent tourist demand. Irsa’s resilience through multiple recessions and the pandemic stems from its disciplined asset management and high-margin structure. Yet, the market often overlooks this due to Argentina’s macro instability and the noise in Irsa’s income statements from frequent asset revaluations."
  },
  {
    "url": "https://finance.yahoo.com/quote/IRS-WS/",
    "text": "Add holdings"
  },
  {
    "url": "https://finance.yahoo.com/news/dave-ramsey-tells-washington-state-160700739.html",
    "text": "Jordan from Spokane, Washington, has collection agencies coming after him, so he called into The Ramsey Show for help negotiating with debt collectors. In particular, a repo agent — also known as a repossession agent, who is employed by a collection agency to repossess property over a failure to make contractual payments — has been “coming at me hard.” Jordan said he has also gone into collections with some household bills. The repo man wants either $5,000 down with smaller monthly payments or a monthly payment of about $800 a month for a year and a half. “I’m the sole provider of a family of four and so that kind of makes it difficult,” Jordan told Dave Ramsey during the episode. Jordan makes about $92,000 a year working in construction. He got behind with his payments when he switched jobs, but ultimately said, “I can make excuses all day but really just being irresponsible with my money.” Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how I'm 49 years old and have nothing saved for retirement — what should I do? Don't panic. Here are 6 of the easiest ways you can catch up (and fast) Nervous about the stock market in 2025? Find out how you can access this $1B private real estate fund (with as little as $10) When you’re overdue with a bill — anything from a phone bill to a car loan to a medical bill — your account could be sent to collection after about three months. Companies may sell your debt to a collection agency and they employ agents who may use fear-based tactics to get you to pay up. But, what happens if you don’t have the money to pay up? Negotiating with debt collectors is way down on Ramsey’s list of priorities for Jordan. Instead, he advises him to start by making a list of everything in his budget. “We’re going to get extremely detailed, extremely organized,” Ramsey said. From there, he recommends Jordan follow what Ramsey calls the Four Walls: food, utilities, shelter and transportation. “Food is first before you buy anything else,” Ramsey said. That means buying food so your family can eat — before dealing with the repo agent. “He’s way down on my list of things to worry about for you.” Buying food means buying groceries, not eating out. “No food at restaurants when you’re in collections,” he said. “You’re broke, you don’t get to go to a restaurant — a restaurant is a luxury.” Second is taking care of utilities, such as water and electricity. That’s second only to food. Since Jordan is behind on some payments, Ramsey says he should “catch it up in the next check before you do anything else other than food.”"
  },
  {
    "url": "https://finance.yahoo.com/news/rocket-lab-usa-inc-rklb-160651280.html",
    "text": "We came across a bullish thesis on Rocket Lab USA, Inc. (RKLB) on Lorenzo Bastianelli’s Substack. In this article, we will summarize the bulls’ thesis on RKLB. Rocket Lab USA, Inc. (RKLB)'s share was trading at $26.45 as of 5th June. A closeup of a spacecraft in launch position, ready for takeoff. Rocket Lab (RKLB) delivered a strong Q1 2025, generating $122.6 million in revenue—a 32.1% year-over-year increase—fuelled by five Electron launches and continued momentum in its Space Systems business. Though revenue dipped sequentially due to lower average selling prices (ASP) for launches and production timing, CFO Adam Spice expressed confidence in higher ASPs and gross margin expansion through 2025. Electron has firmly established dominance in the U.S. small launch market, accounting for 63 launches since 2015—more than triple all competitors combined. The company’s HASTE program also gained traction, securing contracts under the $46 billion EWAAC initiative and seven Department of Defence MACH-TB missions. Central to Rocket Lab’s long-term vision is its vertically integrated approach, which strengthens resilience and positions it as an end-to-end space company. This strategy is reflected in the development of its reusable medium-lift rocket, Neutron, which recently secured a pivotal role in the U.S. Space Force’s $5.6 billion NSSL Phase 3 program, making Rocket Lab the only publicly traded company ever onboarded. With the first Neutron launch targeted for late 2025, key milestones—such as stage qualification, assembly progress, and engine testing—are already in motion. Financially, Rocket Lab is nearing free cash flow positivity, excluding Neutron costs, with Electron on track for 24 annual launches and 50% gross margins. Backed by $517 million in liquidity and a robust mission backlog, Rocket Lab is also pursuing M&A to further strengthen its supply chain and capabilities, exemplified by the pending Mynaric acquisition. Even without Neutron, Electron and Space Systems alone could soon support profitability, limiting downside and amplifying upside potential. Previously, we covered a bullish thesis on Rocket Lab (RKLB) by Steve Wagner, which aligns with Lorenzo Bastianelli’s. The stock has since seen an appreciation of approximately 28%. Wagner focuses on the expanding $1.07 billion backlog, Space Systems’ dominant 71% revenue contribution, and the upcoming Neutron rocket as a long-term growth driver. Taken together, the theses paint a picture of a maturing space infrastructure company, with Neutron providing upside optionality and Electron and Space Systems forming a strong, increasingly profitable base."
  },
  {
    "url": "https://finance.yahoo.com/quote/RKLB/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 13.34B Enterprise Value 13.41B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 31.02 Price/Book (mrq) 30.94 Enterprise Value/Revenue 28.77 Enterprise Value/EBITDA -- Profit Margin -44.32% Return on Assets (ttm) -10.56% Return on Equity (ttm) -45.38% Revenue (ttm) 466.02M Net Income Avi to Common (ttm) -206.53M Diluted EPS (ttm) -0.41 Total Cash (mrq) 428.4M Total Debt/Equity (mrq) 113.54% Levered Free Cash Flow (ttm) -65.72M Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/news/put-100-retirement-fund-month-170111763.html",
    "text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below. Black Hills Corp. (NYSE:BKH) is an electric and natural gas utility company in the U.S. The 52-week range of Black Hills stock price was $51.66 to $65.59. Black Hills' dividend yield is 4.71%. It paid $2.70 per share in dividends during the last 12 months. Don't Miss: Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — you can become an investor for $0.80 per share today. Invest Where It Hurts — And Help Millions Heal: Invest in Cytonics and help disrupt a $390B Big Pharma stronghold. On May 7, the company announced its Q1 2025 earnings, posting EPS of $1.87, coming in below the consensus estimate of $1.93, while revenues of $805.20 million beat the consensus of $706.08 million, as reported by Benzinga. \"Looking ahead, our core utility rate base growth and earnings from our growing data center demand provides strong confidence in our 4% to 6% long-term EPS growth target. By the end of our five-year plan, we expect to serve 500 megawatts of data center demand from existing customers through our innovative business model that requires minimal capital, doubling earnings contribution to more than 10% in 2028,\" said CEO Linn Evans. The company reaffirmed its guidance for full-year 2025, expecting EPS in the range of $4 to $4.20. Trending: Warren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with just $100. If you want to make $100 per month — $1,200 annually — from Black Hills dividends, your investment value needs to be approximately $25,478, which is around 443 shares at $57.45 each. Understanding the dividend yield calculations: When making an estimate, you need two key variables — the desired annual income ($1,200) and the dividend yield (4.71% in this case). So, $1,200 / 0.0471 = $25,478 to generate an income of $100 per month. You can calculate the dividend yield by dividing the annual dividend payments by the current price of the stock. The dividend yield can change over time. This is the outcome of fluctuating stock prices and dividend payments on a rolling basis. See Also: Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation.  For instance, assume a stock that pays $2 as an annual dividend is priced at $50. Its dividend yield would be $2/$50 = 4%. If the stock price rises to $60, the dividend yield drops to 3.33% ($2/$60). A drop in stock price to $40 will have an inverse effect and increase the dividend yield to 5% ($2/$40)."
  },
  {
    "url": "https://finance.yahoo.com/quote/BKH/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 4.15B Enterprise Value 8.45B Trailing P/E 14.66 Forward P/E 13.91 PEG Ratio (5yr expected) 2.44 Price/Sales (ttm) 1.83 Price/Book (mrq) 1.14 Enterprise Value/Revenue 3.83 Enterprise Value/EBITDA 10.56 Profit Margin 12.67% Return on Assets (ttm) 3.23% Return on Equity (ttm) 8.08% Revenue (ttm) 2.21B Net Income Avi to Common (ttm) 279.5M Diluted EPS (ttm) 3.90 Total Cash (mrq) 6.6M Total Debt/Equity (mrq) 115.99% Levered Free Cash Flow (ttm) -173.48M Q4'23 Q3'24 Q4'24 Q1'25 BLACK HILLS CORP has an Investment Rating of HOLD; a target price of $61.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium. BLACK HILLS CORP has an Investment Rating of HOLD; a target price of $62.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium. BLACK HILLS CORP has an Investment Rating of HOLD; a target price of $62.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium. BLACK HILLS CORP has an Investment Rating of HOLD; a target price of $61.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium."
  },
  {
    "url": "https://finance.yahoo.com/news/primerica-inc-pri-bull-case-160613545.html",
    "text": "We came across a bullish thesis on Primerica, Inc. (PRI) on Value Investing subreddit by PortlandCatLover. In this article, we will summarize the bulls’ thesis on PRI. Primerica, Inc. (PRI)'s share was trading at $265.13 as of 5th June. PRI’s trailing P/E was 12.16 according to Yahoo Finance. A senior financial advisor shaking hands with a client next to a wall case displaying certificates of successfully completed financial services. Primerica stands out as a quietly compounding financial powerhouse with roots in middle America and a unique distribution edge. Often compared to Edward Jones, but with a stronger emphasis on selling insurance and investments through community-focused channels like churches, the company benefits from deep client loyalty and a mission-driven workforce. This grassroots approach has translated into a decade of consistent and impressive financial performance. Primerica’s free cash flow per share has compounded at an 18.2% rate over the past ten years, reflecting both operational strength and capital discipline. Its free cash flow margins have steadily improved from 18.1% in 2015 to 26.4% in 2024, while ROIC has climbed from a modest 2.4% to 5.9%, showing growing efficiency in deploying capital. Despite a temporary dip in 2023, 2024 saw a sharp rebound with 33% free cash flow per share growth, underlining resilience. The company’s current free cash flow yield of 9.2% is in line with historical averages but remains compelling in absolute terms, especially given the low leverage and fundamental strength of the business. Primerica has also delivered a stellar 10-year total return CAGR of 21.08%, with a 19.17% gain over the past year, underscoring continued investor confidence. While the stock currently trades below its 52-week high, the improving fundamentals and consistent cash generation suggest latent upside. For long-term investors, Primerica offers a rare combination of grassroots brand loyalty, operational discipline, and capital efficiency, making it a potential compounder still flying under the radar. Previously, we covered a bullish thesis on Primerica (PRI) by Max Dividends in February 2025, which aligns with PortlandCatLover’s analysis on the Value Investing subreddit highlighting consistent free cash flow growth and capital discipline. Both emphasize Primerica’s shareholder-friendly capital return policies, expanding margins, and mission-driven salesforce targeting middle-income America. Max Dividends focuses on institutional ownership, digital investments, and dividend growth as signs of enduring strength. The stock has depreciated by 4.2% since then; however, as mentioned above, the improving fundamentals and consistent cash generation suggest latent upside."
  },
  {
    "url": "https://finance.yahoo.com/quote/PRI/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 8.92B Enterprise Value 10.33B Trailing P/E 12.45 Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 2.91 Price/Book (mrq) 3.95 Enterprise Value/Revenue 3.27 Enterprise Value/EBITDA -- Profit Margin 15.58% Return on Assets (ttm) 4.46% Return on Equity (ttm) 33.35% Revenue (ttm) 3.22B Net Income Avi to Common (ttm) 739.01M Diluted EPS (ttm) 21.80 Total Cash (mrq) 628.1M Total Debt/Equity (mrq) 89.97% Levered Free Cash Flow (ttm) 1.17B Q2'24 Q3'24 Q4'24 Q1'25 PRIMERICA INC has an Investment Rating of BUY; a target price of $300.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. PRIMERICA INC has an Investment Rating of BUY; a target price of $300.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. PRIMERICA INC has an Investment Rating of BUY; a target price of $306.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. PRIMERICA INC has an Investment Rating of BUY; a target price of $298.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium."
  },
  {
    "url": "https://finance.yahoo.com/m/80fa0398-fafb-3306-bc47-2fe67da2c8dd/synchrony-makes-a-comeback-in.html",
    "text": "Walmart-backed fintech OnePay chose Synchrony to issue the retailer’s credit cards. The company had handled Walmart’s credit-cards for nearly two decades until 2018."
  },
  {
    "url": "https://finance.yahoo.com/quote/SYF-PB/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap -- Enterprise Value -- Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) -- Price/Book (mrq) -- Enterprise Value/Revenue -- Enterprise Value/EBITDA -- Profit Margin 34.04% Return on Assets (ttm) 2.44% Return on Equity (ttm) 18.60% Revenue (ttm) 8.71B Net Income Avi to Common (ttm) 2.88B Diluted EPS (ttm) -- Total Cash (mrq) 21.63B Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/news/eli-lilly-company-lly-bull-160545334.html",
    "text": "We came across a bullish thesis on Eli Lilly and Company (LLY) on Business Model Mastery’s Substack. In this article, we will summarize the bulls’ thesis on LLY. Eli Lilly and Company (LLY)'s share was trading at $765.68 as of 5th June. LLY’s trailing and forward P/E were 62.30 and 35.09 respectively according to Yahoo Finance. A picture of a pharma technician preparing an IV injection of a biopharmaceutical product. Eli Lilly is no longer just a pharmaceutical giant—it’s becoming a platform company that’s reshaping the very structure of global healthcare. At the heart of this transformation is tirzepatide, a dual-action molecule marketed under separate brands for diabetes and obesity. This single drug now accounts for over a quarter of Lilly’s total revenue, with the diabetes version generating $11.5 billion (up 330% YoY) and the obesity variant reaching $2.3 billion in its first year—a historic ramp-up. These are not just growth numbers; they’re margin-rich results, with 85 %+ gross margins and minimal marketing spend due to entrenched trust among endocrinologists. Crucially, tirzepatide is protected by a fortress of patents through 2036 and beyond, giving Lilly a durable edge in two massive markets. Unlike peers, Lilly owns its injectable manufacturing end-to-end, having invested over $5.5 billion in internal capacity, giving it unmatched agility and control while rivals struggle with supply constraints. Its sales force and deep prescriber relationships, built over decades, have only grown more powerful thanks to a new direct-to-consumer platform that streamlines initiation and adherence. Meanwhile, the company is reinvesting aggressively, with $11 billion (24% of revenue) spent on focused R&D spanning Alzheimer’s, oncology, and rare diseases. Its pipeline—anchored in metabolic, neurodegenerative, and immune disorders—builds on existing strengths, accelerating commercialization. Competition exists, but Lilly’s molecule consistently outperforms, and its infrastructure outscales. With two-thirds of sales still U.S.-based, global expansion represents the next lever. In sum, Lilly’s model—a convergence of science, scale, and system—positions it as more than a pharma company. It’s a precision biology platform with extraordinary strategic depth and long-term compounding potential. Previously, we covered a bullish thesis on Eli Lilly (LLY) by Kontra on Substack in May 2025, which aligns with Business Model Mastery’s analysis, emphasizing the company’s leadership in obesity and diabetes care. Both highlight tirzepatide’s explosive growth, margin strength, and Lilly’s massive investment in capacity and R&D. Kontra focuses more on near-term financial results, pipeline expansion, and regulatory catalysts, while Business Model Mastery frames Lilly as a precision biology platform with structural advantages—like end-to-end manufacturing and patent longevity—that support durable outperformance. Together, they reinforce Lilly’s status as a long-term compounder with deep moats and global runway."
  },
  {
    "url": "https://finance.yahoo.com/quote/LLY/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 691.15B Enterprise Value 726.44B Trailing P/E 62.64 Forward P/E 35.34 PEG Ratio (5yr expected) 1.18 Price/Sales (ttm) 14.19 Price/Book (mrq) 43.84 Enterprise Value/Revenue 14.82 Enterprise Value/EBITDA 44.64 Profit Margin 22.67% Return on Assets (ttm) 16.45% Return on Equity (ttm) 77.28% Revenue (ttm) 49B Net Income Avi to Common (ttm) 11.11B Diluted EPS (ttm) 12.32 Total Cash (mrq) 3.22B Total Debt/Equity (mrq) 243.61% Levered Free Cash Flow (ttm) -1.82B Q2'24 Q3'24 Q4'24 Q1'25 Eli Lilly is a drug firm with a focus on neuroscience, cardiometabolic, cancer, and immunology. Lilly's key products include Verzenio for cancer; Mounjaro, Zepbound, Jardiance, Trulicity, Humalog, and Humulin for cardiometabolic; and Taltz and Olumiant for immunology. Sustainable Impact Investing is gaining traction not only with Argus Research clients but also with the global investment community. As assets have flowed in over the past 40 years, Sustainable Investing has evolved. The discipline, originally known as Socially Responsible Investing, first focused on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. In time, the list of industries to avoid increased to include soft drinks, fast food, and oil and gas, among numerous others. Performance of initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights. Given the strategy's focus on leading management practices, we expect the growth curve for Sustainable Investing to again slope upward in the years ahead. Eli Lilly is a drug firm with a focus on neuroscience, cardiometabolic, cancer, and immunology. Lilly's key products include Verzenio for cancer; Mounjaro, Zepbound, Jardiance, Trulicity, Humalog, and Humulin for cardiometabolic; and Taltz and Olumiant for immunology. Eli Lilly is a drug firm with a focus on neuroscience, cardiometabolic, cancer, and immunology. Lilly's key products include Verzenio for cancer; Mounjaro, Zepbound, Jardiance, Trulicity, Humalog, and Humulin for cardiometabolic; and Taltz and Olumiant for immunology."
  },
  {
    "url": "https://finance.yahoo.com/news/crocs-inc-crox-bull-case-160437201.html",
    "text": "We came across a bullish thesis on Crocs, Inc. (CROX) on The Finance Corner’s Substack by Kostadin Ristovski. In this article, we will summarize the bulls’ thesis on CROX. Crocs, Inc. (CROX)'s share was trading at $100.17 as of 5th June. CROX’s trailing and forward P/E were 6.18 and 8.61 respectively according to Yahoo Finance. andersphoto / Shutterstock.com Crocs, founded in 2002, has carved out a unique space in the footwear industry with its polarizing design and proprietary Croslite material, offering comfort, lightness, and odor resistance. While its classic clogs and sandals are not inherently exciting, the company has driven engagement through personalization, celebrity partnerships, and Jibbitz accessories—turning its products into cult items especially among Gen Z. The brand saw an unexpected surge during the pandemic, as demand for comfortable, at-home footwear soared, propelling revenue and pushing its stock price from $11 to $180 in just over a year. Recognizing the temporary nature of this boom, management sought to diversify with the acquisition of HEYDUDE for $2.5 billion—a move initially criticized by the market. While HEYDUDE added lightweight, casual loafers to the portfolio and aimed for $1B in revenue by 2024, it fell short at $824M, validating some investor scepticism. However, CEO Andrew Rees has demonstrated strategic discipline, notably through an earlier rationalization that saw a 40% reduction in Crocs stores. Today, the company generates ~$900M in annual free cash flow, focusing on deleveraging and aggressive share buybacks, having reduced shares outstanding by 7% in 2024 alone. Still, questions persist: Is Crocs a lasting brand or a fashion fad? Bear, base, and bull valuation cases suggest fair values between $76 and $143 per share, hinging on this very question. Encouragingly, international markets grew 42% over two years while North America stagnated, and global manufacturing diversification gives Crocs strategic flexibility. At a $5.5B market cap, the company offers attractive upside—if it avoids missteps and remains culturally relevant. Previously, we covered a bullish thesis on Crocs (CROX) by Taylor Nichols, which aligns with Kostadin Ristovski’s take. Since then, the stock has seen an 11% appreciation in price. Both highlight strong cash flow, high margins, and smart capital allocation. Nichols emphasizes valuation upside and financial strength, while Ristovski focuses on brand relevance and international growth. Together, they make a compelling bull case from both quantitative and qualitative angles."
  },
  {
    "url": "https://finance.yahoo.com/quote/CROX/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 5.69B Enterprise Value 7.39B Trailing P/E 6.26 Forward P/E 8.73 PEG Ratio (5yr expected) -- Price/Sales (ttm) 1.45 Price/Book (mrq) 2.89 Enterprise Value/Revenue 1.80 Enterprise Value/EBITDA 6.74 Profit Margin 23.35% Return on Assets (ttm) 12.92% Return on Equity (ttm) 53.70% Revenue (ttm) 4.1B Net Income Avi to Common (ttm) 957.72M Diluted EPS (ttm) 16.21 Total Cash (mrq) 166.46M Total Debt/Equity (mrq) 94.57% Levered Free Cash Flow (ttm) 712.56M Q2'24 Q3'24 Q4'24 Q1'25 CROCS INC has an Investment Rating of HOLD; a target price of $107.000000; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. CROCS INC has an Investment Rating of HOLD; a target price of $115.000000; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. CROCS INC has an Investment Rating of HOLD; a target price of $119.000000; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium. CROCS INC has an Investment Rating of BUY; a target price of $132.000000; an Industry Subrating of Low; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of High; and a Value Subrating of Medium."
  },
  {
    "url": "https://finance.yahoo.com/news/burgess-hodgson-secures-investment-abry-165510332.html",
    "text": "UK accountancy and advisory company Burgess Hodgson has secured an undisclosed investment from US private equity group Abry Partners. The Kent-based firm caters to fast-growing small and medium-sized enterprises (SMEs) and individual customers across the UK. Established in 1938, Burgess Hodgson, with headquarters in Canterbury, offers accounting and advisory services to more than 5,000 SME clients. The firm's team of more than 200 professionals delivers a broad range of services, including audit, tax, accounts advisory, outsourced finance, payroll, and corporate advisory solutions. Abry said the investment represents a key step in the professional services provider’s expansion plans, offering both strategic guidance and financial backing to scale the business. The partnership aims to extend the firm’s geographic reach, strengthen its digital infrastructure, and support selective acquisitions as it evolves into a larger, multi-regional advisory platform. Burgess Hodgson's leadership and partners will maintain significant equity ownership and will continue to guide the firm's strategic direction. As part of the investment, Mark Pacitti, former global leader of Deloitte’s Corporate Finance Advisory practice and past chairman of the ICAEW Corporate Finance Faculty, will join the board of Burgess Hodgson as non-executive chairman. The transaction's completion is contingent upon customary regulatory approvals. Continuum Advisory Partners is acting as the exclusive financial advisor to Burgess Hodgson, while Hines Associates and Paul Hastings (Europe) are advising and providing legal counsel to Abry Partners. \"Burgess Hodgson secures investment from Abry Partners\" was originally created and published by International Accounting Bulletin, a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site."
  },
  {
    "url": "https://finance.yahoo.com/news/floor-decor-holdings-inc-fnd-160409376.html",
    "text": "We came across a bullish thesis on Floor & Decor Holdings, Inc. (FND) on Summit Stock’s Substack. In this article, we will summarize the bulls’ thesis on FND. Floor & Decor Holdings, Inc. (FND)'s share was trading at $ 72.50 as of 5th June. FND’s trailing and forward P/E were 38.36 and 39.06 respectively according to Yahoo Finance. A customer browsing a variety of residential furniture and accessories in a retail store. Floor & Decor (FND), a specialty retailer with over 250 warehouse-format stores focused exclusively on hard-surface flooring, has carved out a strong position in a fragmented industry by offering the widest in-stock selection at everyday low prices. While the broader housing slowdown has dampened growth and pressured its stock, FND is far from a struggling retailer. Underneath the surface lies a business with outstanding unit economics, a durable competitive moat, and a clear path for long-term expansion. Drawing comparisons to Costco, which it mimics through scale-driven efficiencies and aggressive pricing, FND has built a defensible niche that even giants like Home Depot struggle to replicate. Since 2011, it has grown revenue from $300 million to $4.5 billion in 2024, compounding at an impressive 24% annually. Much of this success stems from its disciplined warehouse-store model, narrow product focus, and operational excellence, which together provide cost and logistical advantages that translate into pricing power and customer loyalty. Although growth has decelerated since 2022 due to elevated mortgage rates and softer housing turnover, the underlying story remains compelling. The company is continuing to expand store count through the downturn, which temporarily pressures financial optics but signals management’s confidence in the long-term opportunity. Importantly, this strategic expansion during cyclical weakness could set the stage for an even stronger rebound when housing activity normalizes. For investors willing to look past near-term headwinds, Floor & Decor represents a high-quality, resilient compounder with a wide moat, significant market share potential, and the discipline to execute over the long term. Previously, we covered a bullish thesis on Costco (COST) by FluentInQuality on Substack in March 2025, which aligns thematically with Summit Stock’s bullish take on Floor & Decor (FND). Both highlight scale-driven efficiencies, low-cost operating models, and customer loyalty as core advantages. However, Costco leans on recurring membership income and diversified bulk retail, while FND focuses on a niche product category with pricing power through deep inventory and operational focus. Together, they showcase how warehouse-style retail can compound value across different segments when executed with discipline."
  },
  {
    "url": "https://finance.yahoo.com/quote/FND/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 7.69B Enterprise Value 9.45B Trailing P/E 37.80 Forward P/E 38.61 PEG Ratio (5yr expected) -- Price/Sales (ttm) 1.71 Price/Book (mrq) 3.46 Enterprise Value/Revenue 2.09 Enterprise Value/EBITDA 19.02 Profit Margin 4.53% Return on Assets (ttm) 3.15% Return on Equity (ttm) 9.74% Revenue (ttm) 4.52B Net Income Avi to Common (ttm) 204.72M Diluted EPS (ttm) 1.89 Total Cash (mrq) 186.93M Total Debt/Equity (mrq) 87.92% Levered Free Cash Flow (ttm) 41.53M Q2'24 Q3'24 Q4'24 Q1'25 FLOOR & DECOR HOLDINGS INC-A has an Investment Rating of SELL; a target price of $58.000000; an Industry Subrating of Low; a Management Subrating of Low; a Safety Subrating of Medium; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Medium. FLOOR & DECOR HOLDINGS INC-A has an Investment Rating of SELL; a target price of $58.000000; an Industry Subrating of Low; a Management Subrating of Low; a Safety Subrating of Medium; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of Medium. FLOOR & DECOR HOLDINGS INC-A has an Investment Rating of HOLD; a target price of $83.000000; an Industry Subrating of Low; a Management Subrating of Low; a Safety Subrating of Medium; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of High. FLOOR & DECOR HOLDINGS INC-A has an Investment Rating of HOLD; a target price of $86.000000; an Industry Subrating of Low; a Management Subrating of Low; a Safety Subrating of Medium; a Financial Strength Subrating of Low; a Growth Subrating of Low; and a Value Subrating of High."
  },
  {
    "url": "https://finance.yahoo.com/quote/COST/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 450.10B Enterprise Value 443.43B Trailing P/E 57.57 Forward P/E 50.00 PEG Ratio (5yr expected) 5.39 Price/Sales (ttm) 1.68 Price/Book (mrq) 16.59 Enterprise Value/Revenue 1.65 Enterprise Value/EBITDA 34.28 Profit Margin 2.92% Return on Assets (ttm) 8.79% Return on Equity (ttm) 32.08% Revenue (ttm) 268.78B Net Income Avi to Common (ttm) 7.84B Diluted EPS (ttm) 17.66 Total Cash (mrq) 14.85B Total Debt/Equity (mrq) 30.16% Levered Free Cash Flow (ttm) 6.09B Q3'24 Q4'24 Q1'25 Q2'25 Costco operates 897 stores, for paying members, averaging 147,000 square feet each. Fees from the company's cardholders provided about 2% of its $250 billion in total FY24 revenue. Based in Issaquah, Washington, the company should end 2025 with 914 stores worldwide, with approximately 629 stores in the U.S. and Puerto Rico, 110 stores in Canada, 41 in Mexico, 29 in the United Kingdom, 37 in Japan, 14 in Taiwan, 19 in Korea, 15 in Australia, five in Spain, one in Iceland, one in New Zealand, and two in Sweden, two in France, and seven in China. About 40% of sales are sundries (including candy, alcohol and tobacco); 14% fresh food; 26% non-food including hard-lines (such as electronics and appliances) and soft-lines (including apparel and jewelry); and 20% other ancillary businesses, including gas stations, pharmacy, optical, hearing aids and printing. International stores represent about 27% of total sales and 34% of operating income. At the end of FY24, Costco had approximately 131 million square feet of floor space. Online sales represent approximately 7%, and gas stations represent about 13% of company sales. The company's fiscal year ends on the Sunday closest to August 31. FY23 was a 53-week year. The company's fiscal calendar has 12 weeks in each of the first three quarters and 16 weeks in 4Q. Stocks are lower at Monday midday. Tensions are escalating between China and the U.S. over tariffs. The market is collateral damage at the playground. We start a fresh week and a fresh month. That means the Jobs report is coming on Friday. Argus still expects that report to show a healthy labor market. The yield on the 10-year Treasury note is 4.42%. Oil is up 3% at $63 per barrel. Costco operates a membership-based, no-frills retail model predicated on offering a select product assortment in bulk quantities at bargain prices. The firm avoids maintaining costly product displays by keeping inventory on pallets and limits distribution expenses by storing its inventory at point of sale in the warehouse. Given its frugal cost structure, the firm is able to price its merchandise below that of competing retailers, driving high sales volume per warehouse and generating strong profits on thin margins. Costco operates over 600 warehouses in the United States and has over 60% share in the domestic warehouse club industry. Internationally, Costco operates about 280 warehouses, primarily in Canada, Mexico, Japan, and the UK. Costco operates a membership-based, no-frills retail model predicated on offering a select product assortment in bulk quantities at bargain prices. The firm avoids maintaining costly product displays by keeping inventory on pallets and limits distribution expenses by storing its inventory at point of sale in the warehouse. Given its frugal cost structure, the firm is able to price its merchandise below that of competing retailers, driving high sales volume per warehouse and generating strong profits on thin margins. Costco operates over 600 warehouses in the United States and has over 60% share in the domestic warehouse club industry. Internationally, Costco operates another 280 warehouses, primarily in Canada, Mexico, Japan, and the UK."
  },
  {
    "url": "https://finance.yahoo.com/news/hims-hers-health-inc-hims-160340310.html",
    "text": "We came across a bullish thesis on Hims & Hers Health, Inc. (HIMS) on M. V. Cunha’s Substack. In this article, we will summarize the bulls’ thesis on HIMS. Hims & Hers Health, Inc. (HIMS)'s share was trading at $52.77 as of 5th June. HIMS’s trailing and forward P/E were 77.60 and 86.96 respectively according to Yahoo Finance. A doctor interacting with a patient, discussing the progress of their treatment. Hims & Hers delivered an extraordinary Q1 2025, with revenue soaring 111% YoY to $586M — the company’s fastest top-line growth ever, powered largely by explosive demand for compounded GLP-1s. Though management expects this contribution to taper as commercial semaglutide becomes widely available, full-year revenue is still projected to grow over 60%, underpinned by the company’s expanding portfolio and subscriber base. While non-GLP-1 revenue growth slowed to ~30%, this was largely due to a strategic shift in marketing spend toward weight loss, which is now being reversed. Subscriber count rose 38% to 2.37M, and average monthly revenue per user surged 53% YoY, reinforcing strong unit economics. Although Q2 guidance disappointed and gross margins contracted to 73% due to product mix, management expects margin recovery as semaglutide supply stabilizes. Meanwhile, adjusted EBITDA more than doubled to $91M, and FCF hit $50M despite increased capex — all signs of strong operational leverage and disciplined capital allocation. To sustain momentum and support its ambitious 2030 targets of $6.5B in revenue and $1.3B in EBITDA, HIMS is focused on five key growth levers. First, it’s deepening personalization, which now touches over 60% of subscribers and has meaningfully boosted retention across legacy and newer categories like dermatology, weight loss, and sexual health. Second, it’s expanding into high-impact specialties like hormone therapy, longevity, and early cancer detection, backed by diagnostic acquisitions and a new peptide manufacturing facility aimed at democratizing cutting-edge treatments. Third, HIMS is enhancing platform capabilities through proprietary data and AI tools like MedMatch are making care more intelligent, adaptive, and engaging. Fourth, the company is partnering selectively with blue-chip pharma, most notably Novo Nordisk, to gain clinical credibility and expand access to branded medications. Though regulatory overhang persists, these alliances reduce risk and solidify HIMS as a trusted distribution partner. Lastly, the company is scaling internationally, with early success in the UK validating its model abroad. While insurance partnerships remain off the table by design, the platform’s low-friction, consumer-first approach offers flexibility as it targets other English-speaking markets."
  },
  {
    "url": "https://finance.yahoo.com/news/lemonade-inc-lmnd-bull-case-160316176.html",
    "text": "We came across a bullish thesis on Lemonade, Inc. (LMND) on Investment Ideas by Antonio’s Substack by Antonio Linares. In this article, we will summarize the bulls’ thesis on LMND. Lemonade, Inc. (LMND)'s share was trading at $35.76 as of 5th June. A close-up of a family receiving life insurance coverage documents. Lemonade has demonstrated remarkable scalability, growing its in-force premium by 65% since 2022 while keeping operating expenses flat, which signals both efficient capital deployment and a robust engineering culture. Its AI-driven infrastructure enables it to operate with significant leverage, but the central question remains whether this AI also allows Lemonade to price insurance risk more accurately than traditional players. Although visibility on this front is limited, management's execution over the past few years suggests promising odds of solving the risk-pricing puzzle. Currently, Lemonade’s unit economics remain negative, as reflected in its free cash flow per share, though the trajectory is improving. The company’s strategy hinges on scaling first, subsidizing customers to build a proprietary dataset rich enough to power its AI models, rather than attempting to acquire an external, multidimensional dataset like Meta’s social graph. This approach is more feasible and aligns with management’s long-held goal of reaching EBITDA breakeven by 2026. CEO Dan Schreiber’s comments in the Q1 2025 earnings call highlighted Lemonade’s real-time, AI-powered underwriting capabilities, which allow granular, customer-level investment decisions that no other insurer appears to match. While lacking a dense social graph makes Lemonade vulnerable to future disruption from data-rich platforms, its steadily declining gross loss ratio, down to 59% excluding the California wildfires, indicates rapidly improving underwriting precision. If this trend holds, Lemonade could evolve into a winner-takes-all player in AI-native insurance. Still, negative cash flow introduces risk, and although the price-to-sales ratio has doubled over the past year to 4. Previously, we covered a bullish thesis on Lemonade (LMND) by Steve Wagner, which aligns with Antonio Linares’ June 2025 analysis, emphasizing scalability and AI-native infrastructure. The stock has since seen an appreciation of approximately 15%. Both highlight Lemonade’s improving loss ratios, disciplined cost control, and trajectory toward breakeven. However, Wagner leans on near-term financial execution and intrinsic valuation upside, while Linares frames Lemonade as a long-term AI data flywheel, focusing more on structural competitive advantages. Together, they reinforce confidence in Lemonade’s upside, though with differing emphasis on timeline and tech differentiation."
  },
  {
    "url": "https://finance.yahoo.com/quote/LMND-WT/",
    "text": "Add holdings Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap -- Enterprise Value -- Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) -- Price/Book (mrq) -- Enterprise Value/Revenue -- Enterprise Value/EBITDA -- Profit Margin -- Return on Assets (ttm) -- Return on Equity (ttm) -- Revenue (ttm) -- Net Income Avi to Common (ttm) -- Diluted EPS (ttm) -- Total Cash (mrq) -- Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) -- Q2'24 Q3'24 Q4'24 Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/news/coreweave-inc-crwv-bull-case-160240367.html",
    "text": "We came across a bullish thesis on CoreWeave, Inc. (CRWV) on Outperforming the Market’s Substack by Simple Investing. In this article, we will summarize the bulls’ thesis on CRWV. CoreWeave, Inc. (CRWV)'s share was trading at $ 135.05 as of 5th June. A scientist at a computer station, surrounded by a neural network of artificial intelligence code. CoreWeave’s IPO has become one of the most closely watched in recent memory, offering a rare inside look into the infrastructure powering today’s AI revolution. Originally founded as The Atlantic Crypto Corporation in 2017, the company pivoted from crypto mining to GPU-based cloud computing in 2022, just as demand for accelerated AI workloads began to explode. This well-timed shift has fueled explosive growth, with revenue soaring from $20 million in 2022 to $1.9 billion in 2024. CoreWeave now operates 32 data centers with over 250,000 Nvidia GPUs and more than 360 MW of active power, enabling it to serve top-tier clients such as OpenAI, Microsoft, Meta, Cohere, and Mistral. Its vertically integrated, Kubernetes-native platform is purpose-built for AI and delivers significantly higher performance, including up to 20% better Model FLOPS Utilization than legacy hyperscalers. Deeply tied to Nvidia—its largest partner and shareholder with a 5% stake—CoreWeave is often first to bring new GPU architectures like the H200 and GB200 NVL72 to market. While this relationship gives CoreWeave a competitive edge, it also presents concentration risks, as all current customer contracts mandate Nvidia hardware. Its business model centers on long-term, take-or-pay contracts averaging four years in duration, with 96% of 2024 revenue underpinned by these commitments. Customers prepay before CoreWeave installs capacity, derisking its growth. Now publicly listed, CoreWeave represents a compelling lens into the evolving AI infrastructure stack, combining purpose-built architecture, strategic alignment with Nvidia, and financial predictability, making it a cornerstone player in the AI economy. While CrowdStrike (CRWD) faces scrutiny over its elevated valuation and operational headwinds, CoreWeave (CRWV) offers a contrasting AI infrastructure bet rooted in explosive growth and Nvidia alignment. Both are central to the AI narrative—CRWD on the security front and CRWV on the compute backbone—but CoreWeave’s take-or-pay contracts and visibility into future revenues provide a level of financial derisking not currently seen in CRWD’s high-multiple, sentiment-sensitive profile. Previously, we covered a bearish thesis on CrowdStrike (CRWD) by Stock Whisperer on Substack in May 2025, pointing to bearish technicals, workforce reductions, and sentiment risk. While both highlight valuation concerns, Stock Whisperer adds near-term catalysts for caution, framing CRWD as vulnerable despite its long-term strength. Viewed together, CRWD and CRWV offer a study in contrasting AI exposure—mature cybersecurity versus hyper-growth infra."
  },
  {
    "url": "https://finance.yahoo.com/quote/CRWV/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 67.27B Enterprise Value 77.89B Trailing P/E -- Forward P/E -- PEG Ratio (5yr expected) -- Price/Sales (ttm) 24.09 Price/Book (mrq) 21.92 Enterprise Value/Revenue 28.76 Enterprise Value/EBITDA 85.37 Profit Margin -38.73% Return on Assets (ttm) -- Return on Equity (ttm) -- Revenue (ttm) 2.71B Net Income Avi to Common (ttm) -1.15B Diluted EPS (ttm) -2.54 Total Cash (mrq) 1.28B Total Debt/Equity (mrq) 387.61% Levered Free Cash Flow (ttm) -- Q1'25"
  },
  {
    "url": "https://finance.yahoo.com/quote/NVDA/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 3.46T Enterprise Value 3.41T Trailing P/E 45.72 Forward P/E 33.00 PEG Ratio (5yr expected) 1.76 Price/Sales (ttm) 23.60 Price/Book (mrq) 41.22 Enterprise Value/Revenue 22.99 Enterprise Value/EBITDA 37.53 Profit Margin 51.69% Return on Assets (ttm) 53.24% Return on Equity (ttm) 115.46% Revenue (ttm) 148.51B Net Income Avi to Common (ttm) 76.77B Diluted EPS (ttm) 3.10 Total Cash (mrq) 53.69B Total Debt/Equity (mrq) 12.27% Levered Free Cash Flow (ttm) 55.44B Q2'24 Q3'24 Q4'24 Q1'25 The Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions. Sustainable Impact Investing is gaining traction not only with Argus Research clients but also with the global investment community. As assets have flowed in over the past 40 years, Sustainable Investing has evolved. The discipline, originally known as Socially Responsible Investing, first focused on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. In time, the list of industries to avoid increased to include soft drinks, fast food, and oil and gas, among numerous others. Performance of initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights. Given the strategy's focus on leading management practices, we expect the growth curve for Sustainable Investing to again slope upward in the years ahead. Nvidia Corp., based in Santa Clara, California, is a visual computing company with worldwide operations and markets. The company operates through two segments, Graphics and Compute & Networking. The company's four main markets are Gaming, Professional Visualization, Data Center, and Automotive. In calendar 2020, Nvidia completed the acquisition of data-center connectivity leader Mellanox. Cutting Forecasts in an Unsettled Environment We are adjusting our estimates of S&P 500 earnings from continuing operations for calendar 2025 and 2026 to reflect potential negative impacts on earnings from higher costs and reduced commerce. Normally, we would adjust our EPS forecasts once or perhaps twice over the course of a year. We are not sure what will happen with tariffs and White House policy, but we may need to adjust our forecasts a few more times over the remainder of 2025. For now, our EPS reductions are tweaks rather than big moves. On the upside, the first-quarter earnings season modestly outperformed our expectations, with annual EPS growth of about 14%; we had been modeling high-single-digit to low-double-digit EPS growth. On the downside, where steep tariffs are scheduled and then paused or pushed out, companies are still struggling to finalize 2025 capital budgets. Major corporations have proposed a range of strategies to deal with tariffs. At either end of the spectrum, Walmart says it will pass along tariffs to its customers; and Home Depot says it will absorb the cost of tariffs. The Walmart strategy, as the company has acknowledged, could result in lost revenue as customers (particularly in the lower tiers of the economy) forego planned purchases and make do with less. The Home Depot strategy, in theory, should do a better job of protecting the revenue stream -- but inevitably will cut into margins and thus earnings. We believe most companies will strike a balance somewhere in the middle, passing along some portion and absorbing some portion of tariffs. The 'mix' of pass along and absorb likely will vary from company to company, based on a range of factors. These could include where a company sources raw materials, which regional markets are served, and which products and components are partially or fully exempt from tariffs. 2025 EPS: After a Strong 1Q, Softer in the Middle First-quarter 2025 earnings season took place amid a major shift in U.S. trade policy that drove a turbulent response in asset markets. The U.S. ended the Biden presidency era with much of the tariff architecture intact from President Trump's first term. On April 2, days before the large money center banks began the reporting season, the president unleashed his schedule of 'Liberation Day' tariffs across dozens of nations. Although the high tariff rates were proposals meant to act as negotiating tools, they sent the stock market crashing. The president's criticism of Fed Chair Jay Powell slammed the bond market and the U.S. dollar, further contributing to unease. Subsequently, certain key tariff shifts (on China, the UK, etc.) and a more conciliatory tone toward the Fed allowed the stock market to surge back to year-opening levels. Amid this turbulence, the only 'normal' thing was 1Q25 earnings season. As is common, earnings exceeded expectations; these expectations were uncommonly gloomy as the trade environment worsened. As the quarter progressed, the blended EPS growth estimates from FactSet, Refinitiv, and Bloomberg all ticked 500 to 600 basis points higher than they were at the beginning of the earnings season, as upside surprises displaced conservative estimates in the blended tally. The three EPS compiling agencies all calculated final 1Q25 EPS growth in the 13%-14% range. About 75% of companies surpassed Street expectations; early in the reporting season, that percentage was closer to 70%. On a long-term basis (past 10 years), about three-quarters of companies reporting EPS growth have surprised to the upside. Additionally, the magnitude of the EPS beat jumped meaningfully higher as the quarter progressed, to around 9%. That is better than the 7% long-term average and now also in line with the 9% intermediate-term average. First-quarter earnings growth and revenue growth were perceived as having benefited from some 'front-loading' by businesses as a way to acquire raw materials and goods inventories ahead of anticipated tariffs. We also think some consumers may have accelerated purchases of goods, particularly those made in China, with an eye to potential price hikes in coming months. We think this pulling-forward of business and consumer activity into 1Q25, along with foregone sales at companies passing along tariffs and margin hits at companies absorbing tariffs, will be felt in second-quarter earnings and to a lesser extent in third-quarter earnings. We look for a return to stronger EPS growth in 2026, assuming tariff stability, but not as strong as we had earlier modeled. Revisions to 2025 and 2026 EPS Estimates Until the final tariff schedule is established -- not just in the U.S. but among our trading partners as well -- there will be a fair amount of speculation in any single EPS estimate, much less all the estimates for the hundreds of companies in the S&P 500. Also worth keeping in mind is that tariffs are far from the only driver of revenue and earnings growth. For 2025, our forecast for S&P 500 earnings from continuing operations is $270, reduced from $276. For 2026, our new estimate is $300, reduced from $307. Our new 2025 EPS estimate implies full-year EPS growth of 10%, reduced from 12%. And our new 2026 estimate assumes EPS growth of 10%, reduced from 11%. For the middle quarters of 2025, we are using more-conservative growth assumptions for most sectors. In particular, we have reduced our 2025 growth assumptions for Consumer Discretionary, Healthcare, Industrial, and Information Technology. Consumer Discretionary faces the triple whammy of already-high goods inflation, the potential for further price hikes due to tariffs, and financing rates for large-ticket items that remain too high. We still look for Healthcare EPS to grow in double-digit percentages, but have cut our growth forecast nearly in half due to the potential for White House-mandated lower drug prices and pressure on insurance company earnings from elevated procedure volumes (hips, knees, etc.). Industrial earnings could be impacted by reduced foreign demand for big-ticket equipment from machine tools to excavators to commercial aircraft. Information Technology, the largest sector, faces an appropriately large basket of risks. These include on-again, off-again tariffs on smartphones, PCs, and semiconductors, and an ever-shifting web of regulation on what technology can and cannot be shipped to China. Conclusion Our 2025 EPS growth forecast is bookended by low-double-digit growth in 1Q25 and 4Q25, with mid-single-digit growth in the middle quarters of the year. We then look for more-stable but partly-subdued growth across 2026. Accordingly, our EPS growth estimates are 10% for both 2025 and 2026. Bloomberg, which compiles analyst estimates from hundreds of companies, is now forecasting that 2025 EPS growth will slip to 7.4% in 2025 before bouncing back to 13.1% in 2026. The net effect is that the Argus and Bloomberg 2026 EPS estimates are identical at a rounded $300. In offering a 'smoothed' earnings forecast, Argus is taking into account the fact that corporate America, which may seem like a set of large faceless entities, actually fights for EPS growth at a very granular level. Nearly every major company will feature several major divisions. Each division will have segments that have sub-segments, burrowing down to a final mid-level manager overseeing a dozen or so employees. In each of these tiny pieces of the whole, the manager and team are using everything they have at their disposal to find efficiencies, negotiate hard with vendors and customers, and find new incentives to drive business activity. The unheralded work of these teams, rather than the polish of the C-Suite, is why S&P 500 companies consistently beat EPS expectations by 5%-8%. In the tariff wars, new workarounds are emerging, while familiar ones are being exploited. Under the First Sale rule, the tariff is assessed on the first transaction related to finished good. With some creative freight handling, this can reduce a tariff substantially. If the White House decides to play whack-a-mole with the First Sale rule, as it did with the de minimus exemption, other workarounds are likely to pop up. The stock market is back to approximately year-opening levels, while the earnings outlook is somewhat weaker. The economic outlook remains clouded by tariffs and trade wars. In this uncertain environment, we would continue to focus on companies with strong management, blue chip finances, clear competitive advantage, and the ability to create and monetize a steady stream of new, in-demand products."
  },
  {
    "url": "https://finance.yahoo.com/m/6c7b1519-d941-3a08-98c7-1fe14a3c6691/mcdonald%E2%80%99s-stock-faces-new.html",
    "text": "Morgan Stanley downgraded McDonald’s stock to Equal-Weight from Overweight, and trimmed its price target to $324 from $329."
  },
  {
    "url": "https://finance.yahoo.com/quote/MCD/",
    "text": "Add holdings Trailing total returns as of 6/9/2025, which may include dividends or other distributions. Benchmark is\nS&P 500 (^GSPC)\n. Select to analyze similar companies using key performance metrics; select up to 4 stocks. Market Cap 219.77B Enterprise Value 271.30B Trailing P/E 27.13 Forward P/E 25.00 PEG Ratio (5yr expected) 2.74 Price/Sales (ttm) 8.61 Price/Book (mrq) -- Enterprise Value/Revenue 10.55 Enterprise Value/EBITDA 19.54 Profit Margin 31.75% Return on Assets (ttm) 13.42% Return on Equity (ttm) -- Revenue (ttm) 25.71B Net Income Avi to Common (ttm) 8.16B Diluted EPS (ttm) 11.34 Total Cash (mrq) 1.24B Total Debt/Equity (mrq) -- Levered Free Cash Flow (ttm) 5.31B Q2'24 Q3'24 Q4'24 Q1'25 McDonald’s is the largest restaurant owner-operator in the world, with 2024 system sales of $131 billion across more than 43,000 stores and 115 markets. McDonald’s pioneered the franchise model, building its footprint through partnerships with independent restaurant franchisees and master franchise partners around the globe. The firm earns roughly 60% of its revenue from franchise royalty fees and lease payments, with most of the remainder coming from company-operated stores across its three core segments: the United States, internationally operated markets, and international developmental/licensed markets. Since April 21 (or since the secondary market low and eight days after \"the\" closing low of the correction in the major indices), stocks have enjoyed a massive and consistent tailwind. The S&P 500 (SPX) has risen in 16 out of 19 trade days, and the three daily losses were inconsequential. Since the April 8 bottom, the SPX has soared 19.6% in 27 days, the Nasdaq has surged 26%, and the Nasdaq 100 (QQQ) has popped 25%. That performance is the best since, and very reminiscent of, the pandemic. As well, those 27-day returns (ex. the pandemic) are the best since April 2009, when stocks were coming out of the financial crisis. With this kind of steady and persistent rally pushing the SPX to within 3% of its February 19 all-time high, the Nasdaq to within 5% of its December 16 all-time high, and the QQQ to within 3.3% of its February 19 all-time high, one would expect the investment masses to be pushing the \"very bullish\" sentiment button. Indeed, they almost always have in the past, as sentiment follows price. But that is not the case with this rally, although some indicators are finally pushing to extreme bullish levels. The five-day CBOE equity-only put/call (PC) ratio has dropped to 0.48 from 0.73 on April 8, the lowest and most-overheated P/C since July 2023, just before the July through August pullback. Hedge fund exposure and the NAAIM Exposure Index have not reached extreme levels, consumer confidence has hit its lowest level since the pandemic, and, within the consumer-sentiment survey, more participants believe stocks will move lower. (Mark Arbeter, CMT) This pick list highlights constituents of the Morningstar US Large Cap Index that we believe offer investors the best risk-adjusted return prospects. Stocks of large-cap companies where neither growth nor value characteristics predominate. Stocks in the top 70% of the capitalization of the U.S. equity market are defined as large cap. McDonald's is the world's largest restaurant chain, with more than 40,000 fast-food restaurants in over 100 countries. With a market capitalization above $227 billion, MCD is a large-cap growth stock."
  }
]