[
  {
    "url": "https://finance.yahoo.com/quote/SPY/",
    "text": "Add holdings The trust seeks to achieve its investment objective by holding a portfolio of the common stocks that are included in the index, with the weight of each stock in the portfolio substantially corresponding to the weight of such stock in the index. SPDR State Street Global Advisors Large Blend 572.93B 1993-01-22 Trailing returns as of 6/2/2025. Category is Large Blend. Costco operates 897 stores, for paying members, averaging 147,000 square feet each. Fees from the company's cardholders provided about 2% of its $250 billion in total FY24 revenue. Based in Issaquah, Washington, the company should end 2025 with 914 stores worldwide, with approximately 629 stores in the U.S. and Puerto Rico, 110 stores in Canada, 41 in Mexico, 29 in the United Kingdom, 37 in Japan, 14 in Taiwan, 19 in Korea, 15 in Australia, five in Spain, one in Iceland, one in New Zealand, and two in Sweden, two in France, and seven in China. About 40% of sales are sundries (including candy, alcohol and tobacco); 14% fresh food; 26% non-food including hard-lines (such as electronics and appliances) and soft-lines (including apparel and jewelry); and 20% other ancillary businesses, including gas stations, pharmacy, optical, hearing aids and printing. International stores represent about 27% of total sales and 34% of operating income. At the end of FY24, Costco had approximately 131 million square feet of floor space. Online sales represent approximately 7%, and gas stations represent about 13% of company sales. The company's fiscal year ends on the Sunday closest to August 31. FY23 was a 53-week year. The company's fiscal calendar has 12 weeks in each of the first three quarters and 16 weeks in 4Q. Stocks are lower at Monday midday. Tensions are escalating between China and the U.S. over tariffs. The market is collateral damage at the playground. We start a fresh week and a fresh month. That means the Jobs report is coming on Friday. Argus still expects that report to show a healthy labor market. The yield on the 10-year Treasury note is 4.42%. Oil is up 3% at $63 per barrel. Alibaba is the world’s largest online and mobile commerce company as measured by gross merchandise volume. It operates China’s online marketplaces, including Taobao (consumer-to-consumer) and Tmall (business-to-consumer). The China commerce retail division is the most valuable cash flow-generating business at Alibaba. Additional revenue sources include China commerce wholesale, international commerce retail/wholesale, local consumer services, cloud computing, digital media and entertainment platforms, Cainiao logistics services, and innovation initiatives/other. Advanced Micro Devices designs a variety of digital semiconductors for markets such as PCs, gaming consoles, data centers, industrial, and automotive applications. AMD’s traditional strength was in central processing units and graphics processing units used in PCs and data centers. Additionally, the firm supplies the chips found in prominent game consoles such as the Sony PlayStation and Microsoft Xbox. In 2022, the firm acquired field-programmable gate array leader Xilinx to diversify its business and augment its opportunities in key end markets such as data center and automotive."
  },
  {
    "url": "https://finance.yahoo.com/quote/GLD/",
    "text": "Add holdings The Trust holds gold bars and from time to time, issues Baskets in exchange for deposits of gold and distributes gold in connection with redemptions of Baskets. The investment objective of the Trust is for the Shares to reflect the performance of the price of gold bullion, less the Trust’s expenses. The Sponsor believes that, for many investors, the Shares represent a cost-effective investment in gold. SPDR State Street Global Advisors Commodities Focused 100.21B 2004-11-18 Trailing returns as of 6/2/2025. Category is Commodities Focused. Sustainable Impact Investing is gaining traction not only with Argus Research clients but also with the global investment community. As assets have flowed in over the past 40 years, Sustainable Investing has evolved. The discipline, originally known as Socially Responsible Investing, first focused on excluding companies that conducted business in South Africa, or participated in industries such as tobacco, alcohol, and firearms. In time, the list of industries to avoid increased to include soft drinks, fast food, and oil and gas, among numerous others. Performance of initial strategies lagged, and the approach has been modified. Now, instead of merely identifying industries to avoid, the discipline promotes \"sustainable\" business practices across all industries that can have an \"impact\" on global issues such as climate, hunger, poverty, disease, shelter, and workers' rights. Given the strategy's focus on leading management practices, we expect the growth curve for Sustainable Investing to again slope upward in the years ahead. Freeport-McMoRan owns stakes in 10 copper mines, led by its 49% ownership of the Grasberg copper and gold operations in Indonesia, 55% of the Cerro Verde mine in Peru, and 72% of Morenci in Arizona. It sold around 1.2 million metric tons of copper (its share) in 2024, making it the one of the world’s largest copper miners by volume. It also sold about 900,000 ounces of gold, mostly from Grasberg, and 70 million pounds of molybdenum. It had about 25 years of copper reserves at the end of December 2024. We expect it to sell similar amounts of copper midcycle in 2029, though we expect gold volumes to decline to about 700,000 ounces then due to falling production at Grasberg. Based in Toronto, Barrick Gold is one of the world's largest gold miners. In 2024, the firm produced nearly 3.9 million attributable ounces of gold and about 430 million pounds of copper. At year-end 2024, Barrick had about two decades of gold reserves along with significant copper reserves. After buying Randgold in 2019 and combining its Nevada mines in a joint venture with competitor Newmont later that year, it operates mines in 19 countries in the Americas, Africa, the Middle East, and Asia. The company also has growing copper exposure. Its potential Reko Diq project in Pakistan, if developed, could double copper production by the end of the decade. Newmont is the world's largest gold miner. It bought Goldcorp in 2019, combined its Nevada mines in a joint venture with competitor Barrick later that year, and also purchased competitor Newcrest in November 2023. Its portfolio includes 17 wholly or majority owned mines and interests in two joint ventures in the Americas, Africa, Australia and Papua New Guinea. The company is expected to sell roughly 5.6 million ounces of gold in 2025 from its core mines after selling six higher-cost, smaller mines. Newmont also produces material amounts of copper, silver, zinc, and lead as byproducts. It had about two decades of gold reserves along with significant byproduct reserves at the end of December 2024."
  },
  {
    "url": "https://finance.yahoo.com/news/over-100k-great-pension-dread-220000737.html",
    "text": "For almost a decade, Joe has worked for the county, pulling in an enviable salary of more than $100K a year. Not only does he have job security, but he also gets generous vacation time, health insurance and a pension. His friends and family think he’s got it made. But every morning, Joe dreads going to work. He doesn’t get along with his overbearing manager, and the work environment has turned toxic. On top of that, he’s bored. The job is repetitive, and there’s no room to grow within the department. Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how I'm 49 years old and have nothing saved for retirement — what should I do? Don't panic. Here are 5 of the easiest ways you can catch up (and fast) Nervous about the stock market in 2025? Find out how you can access this $1B private real estate fund (with as little as $10) To get his full pension, Joe still has 30 years of work ahead of him. He can’t imagine staying in a job he hates for three more decades — but he also wonders if the money and benefits are too good to walk away from. Joe isn’t alone. Worker engagement hit an 11-year low in early 2024, with only 30% of full- and part-time American employees saying they felt highly engaged at work, according to Gallup’s long-running workplace poll. So why do they stay? One reason is golden handcuffs — benefits or incentives that make it financially attractive to stick around. That includes pensions, bonuses, stock options and even company cars. Often, you have to stay with an employer for a certain period before you’re eligible for those benefits, which can make some employees feel trapped, especially when they’re already unhappy. Here are a few tips to help you financially plan an exit from a high-paying but soul-draining job. Start by calculating your bare-bones budget — the minimum you need to cover essential expenses like housing, utilities, bills, insurance, transportation, healthcare and groceries. Don’t forget minimum debt payments and regular savings, such as contributions to retirement. Once you add it all up, you’ll have your survival number — the amount you need to earn to meet basic living expenses. That number could help Joe figure out whether a low-paying but more fulfilling job could support his lifestyle. With your survival number in hand, you can take a hard look at your current spending. That means combing through your bank and credit card statements, digital transactions and savings activity."
  },
  {
    "url": "https://finance.yahoo.com/m/d6274bfa-ac6c-3c4c-9759-eea6448bbf8f/musk-says-spacex-revenue-will.html",
    "text": "A busy rocket-launch business and growth in the Starlink satellite division are driving gains for the privately held company."
  }
]